espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_CPU_BUS_MON_CTRL_REG register
 *  cpu_bus_mon read/write control register
 */
#define HP_PERI0_PMS_CPU_BUS_MON_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x8)
/** HP_PERI0_PMS_READ_TEE_CPU_BUS_MON : R/W; bitpos: [0]; default: 1;
 *  Configures cpu_bus_mon registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_CPU_BUS_MON    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_CPU_BUS_MON_M  (HP_PERI0_PMS_READ_TEE_CPU_BUS_MON_V << HP_PERI0_PMS_READ_TEE_CPU_BUS_MON_S)
#define HP_PERI0_PMS_READ_TEE_CPU_BUS_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_CPU_BUS_MON_S  0
/** HP_PERI0_PMS_READ_REE0_CPU_BUS_MON : R/W; bitpos: [1]; default: 0;
 *  Configures cpu_bus_mon registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_CPU_BUS_MON    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_CPU_BUS_MON_M  (HP_PERI0_PMS_READ_REE0_CPU_BUS_MON_V << HP_PERI0_PMS_READ_REE0_CPU_BUS_MON_S)
#define HP_PERI0_PMS_READ_REE0_CPU_BUS_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_CPU_BUS_MON_S  1
/** HP_PERI0_PMS_READ_REE1_CPU_BUS_MON : R/W; bitpos: [2]; default: 0;
 *  Configures cpu_bus_mon registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_CPU_BUS_MON    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_CPU_BUS_MON_M  (HP_PERI0_PMS_READ_REE1_CPU_BUS_MON_V << HP_PERI0_PMS_READ_REE1_CPU_BUS_MON_S)
#define HP_PERI0_PMS_READ_REE1_CPU_BUS_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_CPU_BUS_MON_S  2
/** HP_PERI0_PMS_READ_REE2_CPU_BUS_MON : R/W; bitpos: [3]; default: 0;
 *  Configures cpu_bus_mon registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_CPU_BUS_MON    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_CPU_BUS_MON_M  (HP_PERI0_PMS_READ_REE2_CPU_BUS_MON_V << HP_PERI0_PMS_READ_REE2_CPU_BUS_MON_S)
#define HP_PERI0_PMS_READ_REE2_CPU_BUS_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_CPU_BUS_MON_S  3
/** HP_PERI0_PMS_WRITE_TEE_CPU_BUS_MON : R/W; bitpos: [4]; default: 1;
 *  Configures cpu_bus_mon registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_CPU_BUS_MON    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_CPU_BUS_MON_M  (HP_PERI0_PMS_WRITE_TEE_CPU_BUS_MON_V << HP_PERI0_PMS_WRITE_TEE_CPU_BUS_MON_S)
#define HP_PERI0_PMS_WRITE_TEE_CPU_BUS_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_CPU_BUS_MON_S  4
/** HP_PERI0_PMS_WRITE_REE0_CPU_BUS_MON : R/W; bitpos: [5]; default: 0;
 *  Configures cpu_bus_mon registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_CPU_BUS_MON    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_CPU_BUS_MON_M  (HP_PERI0_PMS_WRITE_REE0_CPU_BUS_MON_V << HP_PERI0_PMS_WRITE_REE0_CPU_BUS_MON_S)
#define HP_PERI0_PMS_WRITE_REE0_CPU_BUS_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_CPU_BUS_MON_S  5
/** HP_PERI0_PMS_WRITE_REE1_CPU_BUS_MON : R/W; bitpos: [6]; default: 0;
 *  Configures cpu_bus_mon registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_CPU_BUS_MON    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_CPU_BUS_MON_M  (HP_PERI0_PMS_WRITE_REE1_CPU_BUS_MON_V << HP_PERI0_PMS_WRITE_REE1_CPU_BUS_MON_S)
#define HP_PERI0_PMS_WRITE_REE1_CPU_BUS_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_CPU_BUS_MON_S  6
/** HP_PERI0_PMS_WRITE_REE2_CPU_BUS_MON : R/W; bitpos: [7]; default: 0;
 *  Configures cpu_bus_mon registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_CPU_BUS_MON    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_CPU_BUS_MON_M  (HP_PERI0_PMS_WRITE_REE2_CPU_BUS_MON_V << HP_PERI0_PMS_WRITE_REE2_CPU_BUS_MON_S)
#define HP_PERI0_PMS_WRITE_REE2_CPU_BUS_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_CPU_BUS_MON_S  7
/** HP_PERI0_PMS_CPU_BUS_MON_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock cpu_bus_mon peri_apm configuration
 */
#define HP_PERI0_PMS_CPU_BUS_MON_LOCK    (BIT(8))
#define HP_PERI0_PMS_CPU_BUS_MON_LOCK_M  (HP_PERI0_PMS_CPU_BUS_MON_LOCK_V << HP_PERI0_PMS_CPU_BUS_MON_LOCK_S)
#define HP_PERI0_PMS_CPU_BUS_MON_LOCK_V  0x00000001U
#define HP_PERI0_PMS_CPU_BUS_MON_LOCK_S  8

/** HP_PERI0_PMS_PSRAM_MON_CTRL_REG register
 *  psram_mon read/write control register
 */
#define HP_PERI0_PMS_PSRAM_MON_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0xc)
/** HP_PERI0_PMS_READ_TEE_PSRAM_MON : R/W; bitpos: [0]; default: 1;
 *  Configures psram_mon registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_PSRAM_MON    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_PSRAM_MON_M  (HP_PERI0_PMS_READ_TEE_PSRAM_MON_V << HP_PERI0_PMS_READ_TEE_PSRAM_MON_S)
#define HP_PERI0_PMS_READ_TEE_PSRAM_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_PSRAM_MON_S  0
/** HP_PERI0_PMS_READ_REE0_PSRAM_MON : R/W; bitpos: [1]; default: 0;
 *  Configures psram_mon registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_PSRAM_MON    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_PSRAM_MON_M  (HP_PERI0_PMS_READ_REE0_PSRAM_MON_V << HP_PERI0_PMS_READ_REE0_PSRAM_MON_S)
#define HP_PERI0_PMS_READ_REE0_PSRAM_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_PSRAM_MON_S  1
/** HP_PERI0_PMS_READ_REE1_PSRAM_MON : R/W; bitpos: [2]; default: 0;
 *  Configures psram_mon registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_PSRAM_MON    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_PSRAM_MON_M  (HP_PERI0_PMS_READ_REE1_PSRAM_MON_V << HP_PERI0_PMS_READ_REE1_PSRAM_MON_S)
#define HP_PERI0_PMS_READ_REE1_PSRAM_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_PSRAM_MON_S  2
/** HP_PERI0_PMS_READ_REE2_PSRAM_MON : R/W; bitpos: [3]; default: 0;
 *  Configures psram_mon registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_PSRAM_MON    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_PSRAM_MON_M  (HP_PERI0_PMS_READ_REE2_PSRAM_MON_V << HP_PERI0_PMS_READ_REE2_PSRAM_MON_S)
#define HP_PERI0_PMS_READ_REE2_PSRAM_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_PSRAM_MON_S  3
/** HP_PERI0_PMS_WRITE_TEE_PSRAM_MON : R/W; bitpos: [4]; default: 1;
 *  Configures psram_mon registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_PSRAM_MON    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_PSRAM_MON_M  (HP_PERI0_PMS_WRITE_TEE_PSRAM_MON_V << HP_PERI0_PMS_WRITE_TEE_PSRAM_MON_S)
#define HP_PERI0_PMS_WRITE_TEE_PSRAM_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_PSRAM_MON_S  4
/** HP_PERI0_PMS_WRITE_REE0_PSRAM_MON : R/W; bitpos: [5]; default: 0;
 *  Configures psram_mon registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_PSRAM_MON    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_PSRAM_MON_M  (HP_PERI0_PMS_WRITE_REE0_PSRAM_MON_V << HP_PERI0_PMS_WRITE_REE0_PSRAM_MON_S)
#define HP_PERI0_PMS_WRITE_REE0_PSRAM_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_PSRAM_MON_S  5
/** HP_PERI0_PMS_WRITE_REE1_PSRAM_MON : R/W; bitpos: [6]; default: 0;
 *  Configures psram_mon registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_PSRAM_MON    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_PSRAM_MON_M  (HP_PERI0_PMS_WRITE_REE1_PSRAM_MON_V << HP_PERI0_PMS_WRITE_REE1_PSRAM_MON_S)
#define HP_PERI0_PMS_WRITE_REE1_PSRAM_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_PSRAM_MON_S  6
/** HP_PERI0_PMS_WRITE_REE2_PSRAM_MON : R/W; bitpos: [7]; default: 0;
 *  Configures psram_mon registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_PSRAM_MON    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_PSRAM_MON_M  (HP_PERI0_PMS_WRITE_REE2_PSRAM_MON_V << HP_PERI0_PMS_WRITE_REE2_PSRAM_MON_S)
#define HP_PERI0_PMS_WRITE_REE2_PSRAM_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_PSRAM_MON_S  7
/** HP_PERI0_PMS_PSRAM_MON_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock psram_mon peri_apm configuration
 */
#define HP_PERI0_PMS_PSRAM_MON_LOCK    (BIT(8))
#define HP_PERI0_PMS_PSRAM_MON_LOCK_M  (HP_PERI0_PMS_PSRAM_MON_LOCK_V << HP_PERI0_PMS_PSRAM_MON_LOCK_S)
#define HP_PERI0_PMS_PSRAM_MON_LOCK_V  0x00000001U
#define HP_PERI0_PMS_PSRAM_MON_LOCK_S  8

