espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_TCM_MON_CTRL_REG register
 *  tcm_mon read/write control register
 */
#define HP_PERI0_PMS_TCM_MON_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x10)
/** HP_PERI0_PMS_READ_TEE_TCM_MON : R/W; bitpos: [0]; default: 1;
 *  Configures tcm_mon registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_TCM_MON    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_TCM_MON_M  (HP_PERI0_PMS_READ_TEE_TCM_MON_V << HP_PERI0_PMS_READ_TEE_TCM_MON_S)
#define HP_PERI0_PMS_READ_TEE_TCM_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_TCM_MON_S  0
/** HP_PERI0_PMS_READ_REE0_TCM_MON : R/W; bitpos: [1]; default: 0;
 *  Configures tcm_mon registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_TCM_MON    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_TCM_MON_M  (HP_PERI0_PMS_READ_REE0_TCM_MON_V << HP_PERI0_PMS_READ_REE0_TCM_MON_S)
#define HP_PERI0_PMS_READ_REE0_TCM_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_TCM_MON_S  1
/** HP_PERI0_PMS_READ_REE1_TCM_MON : R/W; bitpos: [2]; default: 0;
 *  Configures tcm_mon registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_TCM_MON    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_TCM_MON_M  (HP_PERI0_PMS_READ_REE1_TCM_MON_V << HP_PERI0_PMS_READ_REE1_TCM_MON_S)
#define HP_PERI0_PMS_READ_REE1_TCM_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_TCM_MON_S  2
/** HP_PERI0_PMS_READ_REE2_TCM_MON : R/W; bitpos: [3]; default: 0;
 *  Configures tcm_mon registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_TCM_MON    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_TCM_MON_M  (HP_PERI0_PMS_READ_REE2_TCM_MON_V << HP_PERI0_PMS_READ_REE2_TCM_MON_S)
#define HP_PERI0_PMS_READ_REE2_TCM_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_TCM_MON_S  3
/** HP_PERI0_PMS_WRITE_TEE_TCM_MON : R/W; bitpos: [4]; default: 1;
 *  Configures tcm_mon registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_TCM_MON    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_TCM_MON_M  (HP_PERI0_PMS_WRITE_TEE_TCM_MON_V << HP_PERI0_PMS_WRITE_TEE_TCM_MON_S)
#define HP_PERI0_PMS_WRITE_TEE_TCM_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_TCM_MON_S  4
/** HP_PERI0_PMS_WRITE_REE0_TCM_MON : R/W; bitpos: [5]; default: 0;
 *  Configures tcm_mon registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_TCM_MON    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_TCM_MON_M  (HP_PERI0_PMS_WRITE_REE0_TCM_MON_V << HP_PERI0_PMS_WRITE_REE0_TCM_MON_S)
#define HP_PERI0_PMS_WRITE_REE0_TCM_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_TCM_MON_S  5
/** HP_PERI0_PMS_WRITE_REE1_TCM_MON : R/W; bitpos: [6]; default: 0;
 *  Configures tcm_mon registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_TCM_MON    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_TCM_MON_M  (HP_PERI0_PMS_WRITE_REE1_TCM_MON_V << HP_PERI0_PMS_WRITE_REE1_TCM_MON_S)
#define HP_PERI0_PMS_WRITE_REE1_TCM_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_TCM_MON_S  6
/** HP_PERI0_PMS_WRITE_REE2_TCM_MON : R/W; bitpos: [7]; default: 0;
 *  Configures tcm_mon registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_TCM_MON    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_TCM_MON_M  (HP_PERI0_PMS_WRITE_REE2_TCM_MON_V << HP_PERI0_PMS_WRITE_REE2_TCM_MON_S)
#define HP_PERI0_PMS_WRITE_REE2_TCM_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_TCM_MON_S  7
/** HP_PERI0_PMS_TCM_MON_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock tcm_mon peri_apm configuration
 */
#define HP_PERI0_PMS_TCM_MON_LOCK    (BIT(8))
#define HP_PERI0_PMS_TCM_MON_LOCK_M  (HP_PERI0_PMS_TCM_MON_LOCK_V << HP_PERI0_PMS_TCM_MON_LOCK_S)
#define HP_PERI0_PMS_TCM_MON_LOCK_V  0x00000001U
#define HP_PERI0_PMS_TCM_MON_LOCK_S  8

/** HP_PERI0_PMS_CACHE_CTRL_REG register
 *  cache read/write control register
 */
#define HP_PERI0_PMS_CACHE_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x14)
/** HP_PERI0_PMS_READ_TEE_CACHE : R/W; bitpos: [0]; default: 1;
 *  Configures cache registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_CACHE    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_CACHE_M  (HP_PERI0_PMS_READ_TEE_CACHE_V << HP_PERI0_PMS_READ_TEE_CACHE_S)
#define HP_PERI0_PMS_READ_TEE_CACHE_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_CACHE_S  0
/** HP_PERI0_PMS_READ_REE0_CACHE : R/W; bitpos: [1]; default: 0;
 *  Configures cache registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_CACHE    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_CACHE_M  (HP_PERI0_PMS_READ_REE0_CACHE_V << HP_PERI0_PMS_READ_REE0_CACHE_S)
#define HP_PERI0_PMS_READ_REE0_CACHE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_CACHE_S  1
/** HP_PERI0_PMS_READ_REE1_CACHE : R/W; bitpos: [2]; default: 0;
 *  Configures cache registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_CACHE    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_CACHE_M  (HP_PERI0_PMS_READ_REE1_CACHE_V << HP_PERI0_PMS_READ_REE1_CACHE_S)
#define HP_PERI0_PMS_READ_REE1_CACHE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_CACHE_S  2
/** HP_PERI0_PMS_READ_REE2_CACHE : R/W; bitpos: [3]; default: 0;
 *  Configures cache registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_CACHE    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_CACHE_M  (HP_PERI0_PMS_READ_REE2_CACHE_V << HP_PERI0_PMS_READ_REE2_CACHE_S)
#define HP_PERI0_PMS_READ_REE2_CACHE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_CACHE_S  3
/** HP_PERI0_PMS_WRITE_TEE_CACHE : R/W; bitpos: [4]; default: 1;
 *  Configures cache registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_CACHE    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_CACHE_M  (HP_PERI0_PMS_WRITE_TEE_CACHE_V << HP_PERI0_PMS_WRITE_TEE_CACHE_S)
#define HP_PERI0_PMS_WRITE_TEE_CACHE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_CACHE_S  4
/** HP_PERI0_PMS_WRITE_REE0_CACHE : R/W; bitpos: [5]; default: 0;
 *  Configures cache registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_CACHE    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_CACHE_M  (HP_PERI0_PMS_WRITE_REE0_CACHE_V << HP_PERI0_PMS_WRITE_REE0_CACHE_S)
#define HP_PERI0_PMS_WRITE_REE0_CACHE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_CACHE_S  5
/** HP_PERI0_PMS_WRITE_REE1_CACHE : R/W; bitpos: [6]; default: 0;
 *  Configures cache registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_CACHE    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_CACHE_M  (HP_PERI0_PMS_WRITE_REE1_CACHE_V << HP_PERI0_PMS_WRITE_REE1_CACHE_S)
#define HP_PERI0_PMS_WRITE_REE1_CACHE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_CACHE_S  6
/** HP_PERI0_PMS_WRITE_REE2_CACHE : R/W; bitpos: [7]; default: 0;
 *  Configures cache registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_CACHE    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_CACHE_M  (HP_PERI0_PMS_WRITE_REE2_CACHE_V << HP_PERI0_PMS_WRITE_REE2_CACHE_S)
#define HP_PERI0_PMS_WRITE_REE2_CACHE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_CACHE_S  7
/** HP_PERI0_PMS_CACHE_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock cache peri_apm configuration
 */
#define HP_PERI0_PMS_CACHE_LOCK    (BIT(8))
#define HP_PERI0_PMS_CACHE_LOCK_M  (HP_PERI0_PMS_CACHE_LOCK_V << HP_PERI0_PMS_CACHE_LOCK_S)
#define HP_PERI0_PMS_CACHE_LOCK_V  0x00000001U
#define HP_PERI0_PMS_CACHE_LOCK_S  8

/** HP_PERI0_PMS_HP_USBOTG_CORE_CTRL_REG register
 *  hp_usbotg_core read/write control register
 */
#define HP_PERI0_PMS_HP_USBOTG_CORE_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x18)
/** HP_PERI0_PMS_READ_TEE_HP_USBOTG_CORE : R/W; bitpos: [0]; default: 1;
 *  Configures hp_usbotg_core registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_USBOTG_CORE    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_USBOTG_CORE_M  (HP_PERI0_PMS_READ_TEE_HP_USBOTG_CORE_V << HP_PERI0_PMS_READ_TEE_HP_USBOTG_CORE_S)
#define HP_PERI0_PMS_READ_TEE_HP_USBOTG_CORE_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_USBOTG_CORE_S  0
/** HP_PERI0_PMS_READ_REE0_HP_USBOTG_CORE : R/W; bitpos: [1]; default: 0;
 *  Configures hp_usbotg_core registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_USBOTG_CORE    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_USBOTG_CORE_M  (HP_PERI0_PMS_READ_REE0_HP_USBOTG_CORE_V << HP_PERI0_PMS_READ_REE0_HP_USBOTG_CORE_S)
#define HP_PERI0_PMS_READ_REE0_HP_USBOTG_CORE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_USBOTG_CORE_S  1
/** HP_PERI0_PMS_READ_REE1_HP_USBOTG_CORE : R/W; bitpos: [2]; default: 0;
 *  Configures hp_usbotg_core registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_USBOTG_CORE    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_USBOTG_CORE_M  (HP_PERI0_PMS_READ_REE1_HP_USBOTG_CORE_V << HP_PERI0_PMS_READ_REE1_HP_USBOTG_CORE_S)
#define HP_PERI0_PMS_READ_REE1_HP_USBOTG_CORE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_USBOTG_CORE_S  2
/** HP_PERI0_PMS_READ_REE2_HP_USBOTG_CORE : R/W; bitpos: [3]; default: 0;
 *  Configures hp_usbotg_core registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_USBOTG_CORE    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_USBOTG_CORE_M  (HP_PERI0_PMS_READ_REE2_HP_USBOTG_CORE_V << HP_PERI0_PMS_READ_REE2_HP_USBOTG_CORE_S)
#define HP_PERI0_PMS_READ_REE2_HP_USBOTG_CORE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_USBOTG_CORE_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_USBOTG_CORE : R/W; bitpos: [4]; default: 1;
 *  Configures hp_usbotg_core registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_USBOTG_CORE    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_USBOTG_CORE_M  (HP_PERI0_PMS_WRITE_TEE_HP_USBOTG_CORE_V << HP_PERI0_PMS_WRITE_TEE_HP_USBOTG_CORE_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_USBOTG_CORE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_USBOTG_CORE_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_USBOTG_CORE : R/W; bitpos: [5]; default: 0;
 *  Configures hp_usbotg_core registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_USBOTG_CORE    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_USBOTG_CORE_M  (HP_PERI0_PMS_WRITE_REE0_HP_USBOTG_CORE_V << HP_PERI0_PMS_WRITE_REE0_HP_USBOTG_CORE_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_USBOTG_CORE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_USBOTG_CORE_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_USBOTG_CORE : R/W; bitpos: [6]; default: 0;
 *  Configures hp_usbotg_core registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_USBOTG_CORE    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_USBOTG_CORE_M  (HP_PERI0_PMS_WRITE_REE1_HP_USBOTG_CORE_V << HP_PERI0_PMS_WRITE_REE1_HP_USBOTG_CORE_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_USBOTG_CORE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_USBOTG_CORE_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_USBOTG_CORE : R/W; bitpos: [7]; default: 0;
 *  Configures hp_usbotg_core registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_USBOTG_CORE    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_USBOTG_CORE_M  (HP_PERI0_PMS_WRITE_REE2_HP_USBOTG_CORE_V << HP_PERI0_PMS_WRITE_REE2_HP_USBOTG_CORE_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_USBOTG_CORE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_USBOTG_CORE_S  7
/** HP_PERI0_PMS_HP_USBOTG_CORE_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_usbotg_core peri_apm configuration
 */
#define HP_PERI0_PMS_HP_USBOTG_CORE_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_USBOTG_CORE_LOCK_M  (HP_PERI0_PMS_HP_USBOTG_CORE_LOCK_V << HP_PERI0_PMS_HP_USBOTG_CORE_LOCK_S)
#define HP_PERI0_PMS_HP_USBOTG_CORE_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_USBOTG_CORE_LOCK_S  8

/** HP_PERI0_PMS_HP_REGDMA_CTRL_REG register
 *  hp_regdma read/write control register
 */
#define HP_PERI0_PMS_HP_REGDMA_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x1c)
/** HP_PERI0_PMS_READ_TEE_HP_REGDMA : R/W; bitpos: [0]; default: 1;
 *  Configures hp_regdma registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_REGDMA    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_REGDMA_M  (HP_PERI0_PMS_READ_TEE_HP_REGDMA_V << HP_PERI0_PMS_READ_TEE_HP_REGDMA_S)
#define HP_PERI0_PMS_READ_TEE_HP_REGDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_REGDMA_S  0
/** HP_PERI0_PMS_READ_REE0_HP_REGDMA : R/W; bitpos: [1]; default: 0;
 *  Configures hp_regdma registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_REGDMA    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_REGDMA_M  (HP_PERI0_PMS_READ_REE0_HP_REGDMA_V << HP_PERI0_PMS_READ_REE0_HP_REGDMA_S)
#define HP_PERI0_PMS_READ_REE0_HP_REGDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_REGDMA_S  1
/** HP_PERI0_PMS_READ_REE1_HP_REGDMA : R/W; bitpos: [2]; default: 0;
 *  Configures hp_regdma registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_REGDMA    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_REGDMA_M  (HP_PERI0_PMS_READ_REE1_HP_REGDMA_V << HP_PERI0_PMS_READ_REE1_HP_REGDMA_S)
#define HP_PERI0_PMS_READ_REE1_HP_REGDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_REGDMA_S  2
/** HP_PERI0_PMS_READ_REE2_HP_REGDMA : R/W; bitpos: [3]; default: 0;
 *  Configures hp_regdma registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_REGDMA    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_REGDMA_M  (HP_PERI0_PMS_READ_REE2_HP_REGDMA_V << HP_PERI0_PMS_READ_REE2_HP_REGDMA_S)
#define HP_PERI0_PMS_READ_REE2_HP_REGDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_REGDMA_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_REGDMA : R/W; bitpos: [4]; default: 1;
 *  Configures hp_regdma registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_REGDMA    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_REGDMA_M  (HP_PERI0_PMS_WRITE_TEE_HP_REGDMA_V << HP_PERI0_PMS_WRITE_TEE_HP_REGDMA_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_REGDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_REGDMA_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_REGDMA : R/W; bitpos: [5]; default: 0;
 *  Configures hp_regdma registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_REGDMA    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_REGDMA_M  (HP_PERI0_PMS_WRITE_REE0_HP_REGDMA_V << HP_PERI0_PMS_WRITE_REE0_HP_REGDMA_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_REGDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_REGDMA_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_REGDMA : R/W; bitpos: [6]; default: 0;
 *  Configures hp_regdma registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_REGDMA    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_REGDMA_M  (HP_PERI0_PMS_WRITE_REE1_HP_REGDMA_V << HP_PERI0_PMS_WRITE_REE1_HP_REGDMA_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_REGDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_REGDMA_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_REGDMA : R/W; bitpos: [7]; default: 0;
 *  Configures hp_regdma registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_REGDMA    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_REGDMA_M  (HP_PERI0_PMS_WRITE_REE2_HP_REGDMA_V << HP_PERI0_PMS_WRITE_REE2_HP_REGDMA_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_REGDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_REGDMA_S  7
/** HP_PERI0_PMS_HP_REGDMA_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_regdma peri_apm configuration
 */
#define HP_PERI0_PMS_HP_REGDMA_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_REGDMA_LOCK_M  (HP_PERI0_PMS_HP_REGDMA_LOCK_V << HP_PERI0_PMS_HP_REGDMA_LOCK_S)
#define HP_PERI0_PMS_HP_REGDMA_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_REGDMA_LOCK_S  8

/** HP_PERI0_PMS_HP_SDMMC_CTRL_REG register
 *  hp_sdmmc read/write control register
 */
#define HP_PERI0_PMS_HP_SDMMC_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x20)
/** HP_PERI0_PMS_READ_TEE_HP_SDMMC : R/W; bitpos: [0]; default: 1;
 *  Configures hp_sdmmc registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_SDMMC    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_SDMMC_M  (HP_PERI0_PMS_READ_TEE_HP_SDMMC_V << HP_PERI0_PMS_READ_TEE_HP_SDMMC_S)
#define HP_PERI0_PMS_READ_TEE_HP_SDMMC_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_SDMMC_S  0
/** HP_PERI0_PMS_READ_REE0_HP_SDMMC : R/W; bitpos: [1]; default: 0;
 *  Configures hp_sdmmc registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_SDMMC    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_SDMMC_M  (HP_PERI0_PMS_READ_REE0_HP_SDMMC_V << HP_PERI0_PMS_READ_REE0_HP_SDMMC_S)
#define HP_PERI0_PMS_READ_REE0_HP_SDMMC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_SDMMC_S  1
/** HP_PERI0_PMS_READ_REE1_HP_SDMMC : R/W; bitpos: [2]; default: 0;
 *  Configures hp_sdmmc registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_SDMMC    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_SDMMC_M  (HP_PERI0_PMS_READ_REE1_HP_SDMMC_V << HP_PERI0_PMS_READ_REE1_HP_SDMMC_S)
#define HP_PERI0_PMS_READ_REE1_HP_SDMMC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_SDMMC_S  2
/** HP_PERI0_PMS_READ_REE2_HP_SDMMC : R/W; bitpos: [3]; default: 0;
 *  Configures hp_sdmmc registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_SDMMC    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_SDMMC_M  (HP_PERI0_PMS_READ_REE2_HP_SDMMC_V << HP_PERI0_PMS_READ_REE2_HP_SDMMC_S)
#define HP_PERI0_PMS_READ_REE2_HP_SDMMC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_SDMMC_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_SDMMC : R/W; bitpos: [4]; default: 1;
 *  Configures hp_sdmmc registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_SDMMC    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_SDMMC_M  (HP_PERI0_PMS_WRITE_TEE_HP_SDMMC_V << HP_PERI0_PMS_WRITE_TEE_HP_SDMMC_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_SDMMC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_SDMMC_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_SDMMC : R/W; bitpos: [5]; default: 0;
 *  Configures hp_sdmmc registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_SDMMC    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_SDMMC_M  (HP_PERI0_PMS_WRITE_REE0_HP_SDMMC_V << HP_PERI0_PMS_WRITE_REE0_HP_SDMMC_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_SDMMC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_SDMMC_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_SDMMC : R/W; bitpos: [6]; default: 0;
 *  Configures hp_sdmmc registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_SDMMC    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_SDMMC_M  (HP_PERI0_PMS_WRITE_REE1_HP_SDMMC_V << HP_PERI0_PMS_WRITE_REE1_HP_SDMMC_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_SDMMC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_SDMMC_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_SDMMC : R/W; bitpos: [7]; default: 0;
 *  Configures hp_sdmmc registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_SDMMC    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_SDMMC_M  (HP_PERI0_PMS_WRITE_REE2_HP_SDMMC_V << HP_PERI0_PMS_WRITE_REE2_HP_SDMMC_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_SDMMC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_SDMMC_S  7
/** HP_PERI0_PMS_HP_SDMMC_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_sdmmc peri_apm configuration
 */
#define HP_PERI0_PMS_HP_SDMMC_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_SDMMC_LOCK_M  (HP_PERI0_PMS_HP_SDMMC_LOCK_V << HP_PERI0_PMS_HP_SDMMC_LOCK_S)
#define HP_PERI0_PMS_HP_SDMMC_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_SDMMC_LOCK_S  8

