espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_HP_AHB_PDMA_CTRL_REG register
 *  hp_ahb_pdma read/write control register
 */
#define HP_PERI0_PMS_HP_AHB_PDMA_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x24)
/** HP_PERI0_PMS_READ_TEE_HP_AHB_PDMA : R/W; bitpos: [0]; default: 1;
 *  Configures hp_ahb_pdma registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_AHB_PDMA    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_AHB_PDMA_M  (HP_PERI0_PMS_READ_TEE_HP_AHB_PDMA_V << HP_PERI0_PMS_READ_TEE_HP_AHB_PDMA_S)
#define HP_PERI0_PMS_READ_TEE_HP_AHB_PDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_AHB_PDMA_S  0
/** HP_PERI0_PMS_READ_REE0_HP_AHB_PDMA : R/W; bitpos: [1]; default: 0;
 *  Configures hp_ahb_pdma registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_AHB_PDMA    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_AHB_PDMA_M  (HP_PERI0_PMS_READ_REE0_HP_AHB_PDMA_V << HP_PERI0_PMS_READ_REE0_HP_AHB_PDMA_S)
#define HP_PERI0_PMS_READ_REE0_HP_AHB_PDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_AHB_PDMA_S  1
/** HP_PERI0_PMS_READ_REE1_HP_AHB_PDMA : R/W; bitpos: [2]; default: 0;
 *  Configures hp_ahb_pdma registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_AHB_PDMA    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_AHB_PDMA_M  (HP_PERI0_PMS_READ_REE1_HP_AHB_PDMA_V << HP_PERI0_PMS_READ_REE1_HP_AHB_PDMA_S)
#define HP_PERI0_PMS_READ_REE1_HP_AHB_PDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_AHB_PDMA_S  2
/** HP_PERI0_PMS_READ_REE2_HP_AHB_PDMA : R/W; bitpos: [3]; default: 0;
 *  Configures hp_ahb_pdma registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_AHB_PDMA    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_AHB_PDMA_M  (HP_PERI0_PMS_READ_REE2_HP_AHB_PDMA_V << HP_PERI0_PMS_READ_REE2_HP_AHB_PDMA_S)
#define HP_PERI0_PMS_READ_REE2_HP_AHB_PDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_AHB_PDMA_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_AHB_PDMA : R/W; bitpos: [4]; default: 1;
 *  Configures hp_ahb_pdma registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_AHB_PDMA    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_AHB_PDMA_M  (HP_PERI0_PMS_WRITE_TEE_HP_AHB_PDMA_V << HP_PERI0_PMS_WRITE_TEE_HP_AHB_PDMA_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_AHB_PDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_AHB_PDMA_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_AHB_PDMA : R/W; bitpos: [5]; default: 0;
 *  Configures hp_ahb_pdma registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_AHB_PDMA    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_AHB_PDMA_M  (HP_PERI0_PMS_WRITE_REE0_HP_AHB_PDMA_V << HP_PERI0_PMS_WRITE_REE0_HP_AHB_PDMA_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_AHB_PDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_AHB_PDMA_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_AHB_PDMA : R/W; bitpos: [6]; default: 0;
 *  Configures hp_ahb_pdma registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_AHB_PDMA    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_AHB_PDMA_M  (HP_PERI0_PMS_WRITE_REE1_HP_AHB_PDMA_V << HP_PERI0_PMS_WRITE_REE1_HP_AHB_PDMA_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_AHB_PDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_AHB_PDMA_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_AHB_PDMA : R/W; bitpos: [7]; default: 0;
 *  Configures hp_ahb_pdma registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_AHB_PDMA    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_AHB_PDMA_M  (HP_PERI0_PMS_WRITE_REE2_HP_AHB_PDMA_V << HP_PERI0_PMS_WRITE_REE2_HP_AHB_PDMA_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_AHB_PDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_AHB_PDMA_S  7
/** HP_PERI0_PMS_HP_AHB_PDMA_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_ahb_pdma peri_apm configuration
 */
#define HP_PERI0_PMS_HP_AHB_PDMA_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_AHB_PDMA_LOCK_M  (HP_PERI0_PMS_HP_AHB_PDMA_LOCK_V << HP_PERI0_PMS_HP_AHB_PDMA_LOCK_S)
#define HP_PERI0_PMS_HP_AHB_PDMA_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_AHB_PDMA_LOCK_S  8

/** HP_PERI0_PMS_HP_JPEG_CTRL_REG register
 *  hp_jpeg read/write control register
 */
#define HP_PERI0_PMS_HP_JPEG_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x28)
/** HP_PERI0_PMS_READ_TEE_HP_JPEG : R/W; bitpos: [0]; default: 1;
 *  Configures hp_jpeg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_JPEG    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_JPEG_M  (HP_PERI0_PMS_READ_TEE_HP_JPEG_V << HP_PERI0_PMS_READ_TEE_HP_JPEG_S)
#define HP_PERI0_PMS_READ_TEE_HP_JPEG_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_JPEG_S  0
/** HP_PERI0_PMS_READ_REE0_HP_JPEG : R/W; bitpos: [1]; default: 0;
 *  Configures hp_jpeg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_JPEG    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_JPEG_M  (HP_PERI0_PMS_READ_REE0_HP_JPEG_V << HP_PERI0_PMS_READ_REE0_HP_JPEG_S)
#define HP_PERI0_PMS_READ_REE0_HP_JPEG_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_JPEG_S  1
/** HP_PERI0_PMS_READ_REE1_HP_JPEG : R/W; bitpos: [2]; default: 0;
 *  Configures hp_jpeg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_JPEG    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_JPEG_M  (HP_PERI0_PMS_READ_REE1_HP_JPEG_V << HP_PERI0_PMS_READ_REE1_HP_JPEG_S)
#define HP_PERI0_PMS_READ_REE1_HP_JPEG_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_JPEG_S  2
/** HP_PERI0_PMS_READ_REE2_HP_JPEG : R/W; bitpos: [3]; default: 0;
 *  Configures hp_jpeg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_JPEG    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_JPEG_M  (HP_PERI0_PMS_READ_REE2_HP_JPEG_V << HP_PERI0_PMS_READ_REE2_HP_JPEG_S)
#define HP_PERI0_PMS_READ_REE2_HP_JPEG_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_JPEG_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_JPEG : R/W; bitpos: [4]; default: 1;
 *  Configures hp_jpeg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_JPEG    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_JPEG_M  (HP_PERI0_PMS_WRITE_TEE_HP_JPEG_V << HP_PERI0_PMS_WRITE_TEE_HP_JPEG_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_JPEG_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_JPEG_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_JPEG : R/W; bitpos: [5]; default: 0;
 *  Configures hp_jpeg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_JPEG    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_JPEG_M  (HP_PERI0_PMS_WRITE_REE0_HP_JPEG_V << HP_PERI0_PMS_WRITE_REE0_HP_JPEG_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_JPEG_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_JPEG_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_JPEG : R/W; bitpos: [6]; default: 0;
 *  Configures hp_jpeg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_JPEG    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_JPEG_M  (HP_PERI0_PMS_WRITE_REE1_HP_JPEG_V << HP_PERI0_PMS_WRITE_REE1_HP_JPEG_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_JPEG_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_JPEG_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_JPEG : R/W; bitpos: [7]; default: 0;
 *  Configures hp_jpeg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_JPEG    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_JPEG_M  (HP_PERI0_PMS_WRITE_REE2_HP_JPEG_V << HP_PERI0_PMS_WRITE_REE2_HP_JPEG_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_JPEG_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_JPEG_S  7
/** HP_PERI0_PMS_HP_JPEG_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_jpeg peri_apm configuration
 */
#define HP_PERI0_PMS_HP_JPEG_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_JPEG_LOCK_M  (HP_PERI0_PMS_HP_JPEG_LOCK_V << HP_PERI0_PMS_HP_JPEG_LOCK_S)
#define HP_PERI0_PMS_HP_JPEG_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_JPEG_LOCK_S  8

