espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_HP_PPA_CTRL_REG register
 *  hp_ppa read/write control register
 */
#define HP_PERI0_PMS_HP_PPA_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x2c)
/** HP_PERI0_PMS_READ_TEE_HP_PPA : R/W; bitpos: [0]; default: 1;
 *  Configures hp_ppa registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_PPA    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_PPA_M  (HP_PERI0_PMS_READ_TEE_HP_PPA_V << HP_PERI0_PMS_READ_TEE_HP_PPA_S)
#define HP_PERI0_PMS_READ_TEE_HP_PPA_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_PPA_S  0
/** HP_PERI0_PMS_READ_REE0_HP_PPA : R/W; bitpos: [1]; default: 0;
 *  Configures hp_ppa registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_PPA    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_PPA_M  (HP_PERI0_PMS_READ_REE0_HP_PPA_V << HP_PERI0_PMS_READ_REE0_HP_PPA_S)
#define HP_PERI0_PMS_READ_REE0_HP_PPA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_PPA_S  1
/** HP_PERI0_PMS_READ_REE1_HP_PPA : R/W; bitpos: [2]; default: 0;
 *  Configures hp_ppa registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_PPA    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_PPA_M  (HP_PERI0_PMS_READ_REE1_HP_PPA_V << HP_PERI0_PMS_READ_REE1_HP_PPA_S)
#define HP_PERI0_PMS_READ_REE1_HP_PPA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_PPA_S  2
/** HP_PERI0_PMS_READ_REE2_HP_PPA : R/W; bitpos: [3]; default: 0;
 *  Configures hp_ppa registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_PPA    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_PPA_M  (HP_PERI0_PMS_READ_REE2_HP_PPA_V << HP_PERI0_PMS_READ_REE2_HP_PPA_S)
#define HP_PERI0_PMS_READ_REE2_HP_PPA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_PPA_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_PPA : R/W; bitpos: [4]; default: 1;
 *  Configures hp_ppa registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_PPA    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_PPA_M  (HP_PERI0_PMS_WRITE_TEE_HP_PPA_V << HP_PERI0_PMS_WRITE_TEE_HP_PPA_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_PPA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_PPA_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_PPA : R/W; bitpos: [5]; default: 0;
 *  Configures hp_ppa registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_PPA    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_PPA_M  (HP_PERI0_PMS_WRITE_REE0_HP_PPA_V << HP_PERI0_PMS_WRITE_REE0_HP_PPA_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_PPA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_PPA_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_PPA : R/W; bitpos: [6]; default: 0;
 *  Configures hp_ppa registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_PPA    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_PPA_M  (HP_PERI0_PMS_WRITE_REE1_HP_PPA_V << HP_PERI0_PMS_WRITE_REE1_HP_PPA_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_PPA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_PPA_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_PPA : R/W; bitpos: [7]; default: 0;
 *  Configures hp_ppa registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_PPA    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_PPA_M  (HP_PERI0_PMS_WRITE_REE2_HP_PPA_V << HP_PERI0_PMS_WRITE_REE2_HP_PPA_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_PPA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_PPA_S  7
/** HP_PERI0_PMS_HP_PPA_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_ppa peri_apm configuration
 */
#define HP_PERI0_PMS_HP_PPA_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_PPA_LOCK_M  (HP_PERI0_PMS_HP_PPA_LOCK_V << HP_PERI0_PMS_HP_PPA_LOCK_S)
#define HP_PERI0_PMS_HP_PPA_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_PPA_LOCK_S  8

/** HP_PERI0_PMS_HP_DMA2D_CTRL_REG register
 *  hp_dma2d read/write control register
 */
#define HP_PERI0_PMS_HP_DMA2D_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x30)
/** HP_PERI0_PMS_READ_TEE_HP_DMA2D : R/W; bitpos: [0]; default: 1;
 *  Configures hp_dma2d registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_DMA2D    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_DMA2D_M  (HP_PERI0_PMS_READ_TEE_HP_DMA2D_V << HP_PERI0_PMS_READ_TEE_HP_DMA2D_S)
#define HP_PERI0_PMS_READ_TEE_HP_DMA2D_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_DMA2D_S  0
/** HP_PERI0_PMS_READ_REE0_HP_DMA2D : R/W; bitpos: [1]; default: 0;
 *  Configures hp_dma2d registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_DMA2D    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_DMA2D_M  (HP_PERI0_PMS_READ_REE0_HP_DMA2D_V << HP_PERI0_PMS_READ_REE0_HP_DMA2D_S)
#define HP_PERI0_PMS_READ_REE0_HP_DMA2D_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_DMA2D_S  1
/** HP_PERI0_PMS_READ_REE1_HP_DMA2D : R/W; bitpos: [2]; default: 0;
 *  Configures hp_dma2d registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_DMA2D    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_DMA2D_M  (HP_PERI0_PMS_READ_REE1_HP_DMA2D_V << HP_PERI0_PMS_READ_REE1_HP_DMA2D_S)
#define HP_PERI0_PMS_READ_REE1_HP_DMA2D_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_DMA2D_S  2
/** HP_PERI0_PMS_READ_REE2_HP_DMA2D : R/W; bitpos: [3]; default: 0;
 *  Configures hp_dma2d registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_DMA2D    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_DMA2D_M  (HP_PERI0_PMS_READ_REE2_HP_DMA2D_V << HP_PERI0_PMS_READ_REE2_HP_DMA2D_S)
#define HP_PERI0_PMS_READ_REE2_HP_DMA2D_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_DMA2D_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_DMA2D : R/W; bitpos: [4]; default: 1;
 *  Configures hp_dma2d registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_DMA2D    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_DMA2D_M  (HP_PERI0_PMS_WRITE_TEE_HP_DMA2D_V << HP_PERI0_PMS_WRITE_TEE_HP_DMA2D_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_DMA2D_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_DMA2D_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_DMA2D : R/W; bitpos: [5]; default: 0;
 *  Configures hp_dma2d registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_DMA2D    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_DMA2D_M  (HP_PERI0_PMS_WRITE_REE0_HP_DMA2D_V << HP_PERI0_PMS_WRITE_REE0_HP_DMA2D_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_DMA2D_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_DMA2D_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_DMA2D : R/W; bitpos: [6]; default: 0;
 *  Configures hp_dma2d registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_DMA2D    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_DMA2D_M  (HP_PERI0_PMS_WRITE_REE1_HP_DMA2D_V << HP_PERI0_PMS_WRITE_REE1_HP_DMA2D_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_DMA2D_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_DMA2D_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_DMA2D : R/W; bitpos: [7]; default: 0;
 *  Configures hp_dma2d registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_DMA2D    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_DMA2D_M  (HP_PERI0_PMS_WRITE_REE2_HP_DMA2D_V << HP_PERI0_PMS_WRITE_REE2_HP_DMA2D_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_DMA2D_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_DMA2D_S  7
/** HP_PERI0_PMS_HP_DMA2D_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_dma2d peri_apm configuration
 */
#define HP_PERI0_PMS_HP_DMA2D_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_DMA2D_LOCK_M  (HP_PERI0_PMS_HP_DMA2D_LOCK_V << HP_PERI0_PMS_HP_DMA2D_LOCK_S)
#define HP_PERI0_PMS_HP_DMA2D_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_DMA2D_LOCK_S  8

