espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_HP_AXI_PDMA_CTRL_REG register
 *  hp_axi_pdma read/write control register
 */
#define HP_PERI0_PMS_HP_AXI_PDMA_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x34)
/** HP_PERI0_PMS_READ_TEE_HP_AXI_PDMA : R/W; bitpos: [0]; default: 1;
 *  Configures hp_axi_pdma registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_AXI_PDMA    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_AXI_PDMA_M  (HP_PERI0_PMS_READ_TEE_HP_AXI_PDMA_V << HP_PERI0_PMS_READ_TEE_HP_AXI_PDMA_S)
#define HP_PERI0_PMS_READ_TEE_HP_AXI_PDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_AXI_PDMA_S  0
/** HP_PERI0_PMS_READ_REE0_HP_AXI_PDMA : R/W; bitpos: [1]; default: 0;
 *  Configures hp_axi_pdma registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_AXI_PDMA    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_AXI_PDMA_M  (HP_PERI0_PMS_READ_REE0_HP_AXI_PDMA_V << HP_PERI0_PMS_READ_REE0_HP_AXI_PDMA_S)
#define HP_PERI0_PMS_READ_REE0_HP_AXI_PDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_AXI_PDMA_S  1
/** HP_PERI0_PMS_READ_REE1_HP_AXI_PDMA : R/W; bitpos: [2]; default: 0;
 *  Configures hp_axi_pdma registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_AXI_PDMA    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_AXI_PDMA_M  (HP_PERI0_PMS_READ_REE1_HP_AXI_PDMA_V << HP_PERI0_PMS_READ_REE1_HP_AXI_PDMA_S)
#define HP_PERI0_PMS_READ_REE1_HP_AXI_PDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_AXI_PDMA_S  2
/** HP_PERI0_PMS_READ_REE2_HP_AXI_PDMA : R/W; bitpos: [3]; default: 0;
 *  Configures hp_axi_pdma registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_AXI_PDMA    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_AXI_PDMA_M  (HP_PERI0_PMS_READ_REE2_HP_AXI_PDMA_V << HP_PERI0_PMS_READ_REE2_HP_AXI_PDMA_S)
#define HP_PERI0_PMS_READ_REE2_HP_AXI_PDMA_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_AXI_PDMA_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_AXI_PDMA : R/W; bitpos: [4]; default: 1;
 *  Configures hp_axi_pdma registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_AXI_PDMA    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_AXI_PDMA_M  (HP_PERI0_PMS_WRITE_TEE_HP_AXI_PDMA_V << HP_PERI0_PMS_WRITE_TEE_HP_AXI_PDMA_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_AXI_PDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_AXI_PDMA_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_AXI_PDMA : R/W; bitpos: [5]; default: 0;
 *  Configures hp_axi_pdma registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_AXI_PDMA    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_AXI_PDMA_M  (HP_PERI0_PMS_WRITE_REE0_HP_AXI_PDMA_V << HP_PERI0_PMS_WRITE_REE0_HP_AXI_PDMA_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_AXI_PDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_AXI_PDMA_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_AXI_PDMA : R/W; bitpos: [6]; default: 0;
 *  Configures hp_axi_pdma registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_AXI_PDMA    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_AXI_PDMA_M  (HP_PERI0_PMS_WRITE_REE1_HP_AXI_PDMA_V << HP_PERI0_PMS_WRITE_REE1_HP_AXI_PDMA_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_AXI_PDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_AXI_PDMA_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_AXI_PDMA : R/W; bitpos: [7]; default: 0;
 *  Configures hp_axi_pdma registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_AXI_PDMA    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_AXI_PDMA_M  (HP_PERI0_PMS_WRITE_REE2_HP_AXI_PDMA_V << HP_PERI0_PMS_WRITE_REE2_HP_AXI_PDMA_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_AXI_PDMA_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_AXI_PDMA_S  7
/** HP_PERI0_PMS_HP_AXI_PDMA_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_axi_pdma peri_apm configuration
 */
#define HP_PERI0_PMS_HP_AXI_PDMA_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_AXI_PDMA_LOCK_M  (HP_PERI0_PMS_HP_AXI_PDMA_LOCK_V << HP_PERI0_PMS_HP_AXI_PDMA_LOCK_S)
#define HP_PERI0_PMS_HP_AXI_PDMA_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_AXI_PDMA_LOCK_S  8

/** HP_PERI0_PMS_HP_GMAC_CTRL_REG register
 *  hp_gmac read/write control register
 */
#define HP_PERI0_PMS_HP_GMAC_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x38)
/** HP_PERI0_PMS_READ_TEE_HP_GMAC : R/W; bitpos: [0]; default: 1;
 *  Configures hp_gmac registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_GMAC    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_GMAC_M  (HP_PERI0_PMS_READ_TEE_HP_GMAC_V << HP_PERI0_PMS_READ_TEE_HP_GMAC_S)
#define HP_PERI0_PMS_READ_TEE_HP_GMAC_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_GMAC_S  0
/** HP_PERI0_PMS_READ_REE0_HP_GMAC : R/W; bitpos: [1]; default: 0;
 *  Configures hp_gmac registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_GMAC    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_GMAC_M  (HP_PERI0_PMS_READ_REE0_HP_GMAC_V << HP_PERI0_PMS_READ_REE0_HP_GMAC_S)
#define HP_PERI0_PMS_READ_REE0_HP_GMAC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_GMAC_S  1
/** HP_PERI0_PMS_READ_REE1_HP_GMAC : R/W; bitpos: [2]; default: 0;
 *  Configures hp_gmac registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_GMAC    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_GMAC_M  (HP_PERI0_PMS_READ_REE1_HP_GMAC_V << HP_PERI0_PMS_READ_REE1_HP_GMAC_S)
#define HP_PERI0_PMS_READ_REE1_HP_GMAC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_GMAC_S  2
/** HP_PERI0_PMS_READ_REE2_HP_GMAC : R/W; bitpos: [3]; default: 0;
 *  Configures hp_gmac registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_GMAC    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_GMAC_M  (HP_PERI0_PMS_READ_REE2_HP_GMAC_V << HP_PERI0_PMS_READ_REE2_HP_GMAC_S)
#define HP_PERI0_PMS_READ_REE2_HP_GMAC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_GMAC_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_GMAC : R/W; bitpos: [4]; default: 1;
 *  Configures hp_gmac registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_GMAC    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_GMAC_M  (HP_PERI0_PMS_WRITE_TEE_HP_GMAC_V << HP_PERI0_PMS_WRITE_TEE_HP_GMAC_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_GMAC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_GMAC_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_GMAC : R/W; bitpos: [5]; default: 0;
 *  Configures hp_gmac registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_GMAC    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_GMAC_M  (HP_PERI0_PMS_WRITE_REE0_HP_GMAC_V << HP_PERI0_PMS_WRITE_REE0_HP_GMAC_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_GMAC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_GMAC_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_GMAC : R/W; bitpos: [6]; default: 0;
 *  Configures hp_gmac registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_GMAC    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_GMAC_M  (HP_PERI0_PMS_WRITE_REE1_HP_GMAC_V << HP_PERI0_PMS_WRITE_REE1_HP_GMAC_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_GMAC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_GMAC_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_GMAC : R/W; bitpos: [7]; default: 0;
 *  Configures hp_gmac registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_GMAC    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_GMAC_M  (HP_PERI0_PMS_WRITE_REE2_HP_GMAC_V << HP_PERI0_PMS_WRITE_REE2_HP_GMAC_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_GMAC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_GMAC_S  7
/** HP_PERI0_PMS_HP_GMAC_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_gmac peri_apm configuration
 */
#define HP_PERI0_PMS_HP_GMAC_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_GMAC_LOCK_M  (HP_PERI0_PMS_HP_GMAC_LOCK_V << HP_PERI0_PMS_HP_GMAC_LOCK_S)
#define HP_PERI0_PMS_HP_GMAC_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_GMAC_LOCK_S  8

/** HP_PERI0_PMS_HP_PVT0_CTRL_REG register
 *  hp_pvt0 read/write control register
 */
#define HP_PERI0_PMS_HP_PVT0_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x3c)
/** HP_PERI0_PMS_READ_TEE_HP_PVT0 : R/W; bitpos: [0]; default: 1;
 *  Configures hp_pvt0 registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_PVT0    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_PVT0_M  (HP_PERI0_PMS_READ_TEE_HP_PVT0_V << HP_PERI0_PMS_READ_TEE_HP_PVT0_S)
#define HP_PERI0_PMS_READ_TEE_HP_PVT0_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_PVT0_S  0
/** HP_PERI0_PMS_READ_REE0_HP_PVT0 : R/W; bitpos: [1]; default: 0;
 *  Configures hp_pvt0 registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_PVT0    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_PVT0_M  (HP_PERI0_PMS_READ_REE0_HP_PVT0_V << HP_PERI0_PMS_READ_REE0_HP_PVT0_S)
#define HP_PERI0_PMS_READ_REE0_HP_PVT0_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_PVT0_S  1
/** HP_PERI0_PMS_READ_REE1_HP_PVT0 : R/W; bitpos: [2]; default: 0;
 *  Configures hp_pvt0 registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_PVT0    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_PVT0_M  (HP_PERI0_PMS_READ_REE1_HP_PVT0_V << HP_PERI0_PMS_READ_REE1_HP_PVT0_S)
#define HP_PERI0_PMS_READ_REE1_HP_PVT0_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_PVT0_S  2
/** HP_PERI0_PMS_READ_REE2_HP_PVT0 : R/W; bitpos: [3]; default: 0;
 *  Configures hp_pvt0 registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_PVT0    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_PVT0_M  (HP_PERI0_PMS_READ_REE2_HP_PVT0_V << HP_PERI0_PMS_READ_REE2_HP_PVT0_S)
#define HP_PERI0_PMS_READ_REE2_HP_PVT0_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_PVT0_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_PVT0 : R/W; bitpos: [4]; default: 1;
 *  Configures hp_pvt0 registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_PVT0    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_PVT0_M  (HP_PERI0_PMS_WRITE_TEE_HP_PVT0_V << HP_PERI0_PMS_WRITE_TEE_HP_PVT0_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_PVT0_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_PVT0_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_PVT0 : R/W; bitpos: [5]; default: 0;
 *  Configures hp_pvt0 registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_PVT0    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_PVT0_M  (HP_PERI0_PMS_WRITE_REE0_HP_PVT0_V << HP_PERI0_PMS_WRITE_REE0_HP_PVT0_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_PVT0_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_PVT0_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_PVT0 : R/W; bitpos: [6]; default: 0;
 *  Configures hp_pvt0 registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_PVT0    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_PVT0_M  (HP_PERI0_PMS_WRITE_REE1_HP_PVT0_V << HP_PERI0_PMS_WRITE_REE1_HP_PVT0_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_PVT0_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_PVT0_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_PVT0 : R/W; bitpos: [7]; default: 0;
 *  Configures hp_pvt0 registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_PVT0    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_PVT0_M  (HP_PERI0_PMS_WRITE_REE2_HP_PVT0_V << HP_PERI0_PMS_WRITE_REE2_HP_PVT0_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_PVT0_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_PVT0_S  7
/** HP_PERI0_PMS_HP_PVT0_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_pvt0 peri_apm configuration
 */
#define HP_PERI0_PMS_HP_PVT0_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_PVT0_LOCK_M  (HP_PERI0_PMS_HP_PVT0_LOCK_V << HP_PERI0_PMS_HP_PVT0_LOCK_S)
#define HP_PERI0_PMS_HP_PVT0_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_PVT0_LOCK_S  8

/** HP_PERI0_PMS_HP_RMT_CTRL_REG register
 *  hp_rmt read/write control register
 */
#define HP_PERI0_PMS_HP_RMT_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x40)
/** HP_PERI0_PMS_READ_TEE_HP_RMT : R/W; bitpos: [0]; default: 1;
 *  Configures hp_rmt registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_RMT    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_RMT_M  (HP_PERI0_PMS_READ_TEE_HP_RMT_V << HP_PERI0_PMS_READ_TEE_HP_RMT_S)
#define HP_PERI0_PMS_READ_TEE_HP_RMT_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_RMT_S  0
/** HP_PERI0_PMS_READ_REE0_HP_RMT : R/W; bitpos: [1]; default: 0;
 *  Configures hp_rmt registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_RMT    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_RMT_M  (HP_PERI0_PMS_READ_REE0_HP_RMT_V << HP_PERI0_PMS_READ_REE0_HP_RMT_S)
#define HP_PERI0_PMS_READ_REE0_HP_RMT_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_RMT_S  1
/** HP_PERI0_PMS_READ_REE1_HP_RMT : R/W; bitpos: [2]; default: 0;
 *  Configures hp_rmt registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_RMT    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_RMT_M  (HP_PERI0_PMS_READ_REE1_HP_RMT_V << HP_PERI0_PMS_READ_REE1_HP_RMT_S)
#define HP_PERI0_PMS_READ_REE1_HP_RMT_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_RMT_S  2
/** HP_PERI0_PMS_READ_REE2_HP_RMT : R/W; bitpos: [3]; default: 0;
 *  Configures hp_rmt registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_RMT    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_RMT_M  (HP_PERI0_PMS_READ_REE2_HP_RMT_V << HP_PERI0_PMS_READ_REE2_HP_RMT_S)
#define HP_PERI0_PMS_READ_REE2_HP_RMT_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_RMT_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_RMT : R/W; bitpos: [4]; default: 1;
 *  Configures hp_rmt registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_RMT    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_RMT_M  (HP_PERI0_PMS_WRITE_TEE_HP_RMT_V << HP_PERI0_PMS_WRITE_TEE_HP_RMT_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_RMT_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_RMT_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_RMT : R/W; bitpos: [5]; default: 0;
 *  Configures hp_rmt registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_RMT    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_RMT_M  (HP_PERI0_PMS_WRITE_REE0_HP_RMT_V << HP_PERI0_PMS_WRITE_REE0_HP_RMT_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_RMT_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_RMT_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_RMT : R/W; bitpos: [6]; default: 0;
 *  Configures hp_rmt registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_RMT    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_RMT_M  (HP_PERI0_PMS_WRITE_REE1_HP_RMT_V << HP_PERI0_PMS_WRITE_REE1_HP_RMT_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_RMT_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_RMT_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_RMT : R/W; bitpos: [7]; default: 0;
 *  Configures hp_rmt registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_RMT    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_RMT_M  (HP_PERI0_PMS_WRITE_REE2_HP_RMT_V << HP_PERI0_PMS_WRITE_REE2_HP_RMT_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_RMT_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_RMT_S  7
/** HP_PERI0_PMS_HP_RMT_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_rmt peri_apm configuration
 */
#define HP_PERI0_PMS_HP_RMT_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_RMT_LOCK_M  (HP_PERI0_PMS_HP_RMT_LOCK_V << HP_PERI0_PMS_HP_RMT_LOCK_S)
#define HP_PERI0_PMS_HP_RMT_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_RMT_LOCK_S  8

/** HP_PERI0_PMS_HP_BITSCRAMBLER_CTRL_REG register
 *  hp_bitscrambler read/write control register
 */
#define HP_PERI0_PMS_HP_BITSCRAMBLER_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x44)
/** HP_PERI0_PMS_READ_TEE_HP_BITSCRAMBLER : R/W; bitpos: [0]; default: 1;
 *  Configures hp_bitscrambler registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_BITSCRAMBLER    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_BITSCRAMBLER_M  (HP_PERI0_PMS_READ_TEE_HP_BITSCRAMBLER_V << HP_PERI0_PMS_READ_TEE_HP_BITSCRAMBLER_S)
#define HP_PERI0_PMS_READ_TEE_HP_BITSCRAMBLER_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_BITSCRAMBLER_S  0
/** HP_PERI0_PMS_READ_REE0_HP_BITSCRAMBLER : R/W; bitpos: [1]; default: 0;
 *  Configures hp_bitscrambler registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_BITSCRAMBLER    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_BITSCRAMBLER_M  (HP_PERI0_PMS_READ_REE0_HP_BITSCRAMBLER_V << HP_PERI0_PMS_READ_REE0_HP_BITSCRAMBLER_S)
#define HP_PERI0_PMS_READ_REE0_HP_BITSCRAMBLER_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_BITSCRAMBLER_S  1
/** HP_PERI0_PMS_READ_REE1_HP_BITSCRAMBLER : R/W; bitpos: [2]; default: 0;
 *  Configures hp_bitscrambler registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_BITSCRAMBLER    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_BITSCRAMBLER_M  (HP_PERI0_PMS_READ_REE1_HP_BITSCRAMBLER_V << HP_PERI0_PMS_READ_REE1_HP_BITSCRAMBLER_S)
#define HP_PERI0_PMS_READ_REE1_HP_BITSCRAMBLER_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_BITSCRAMBLER_S  2
/** HP_PERI0_PMS_READ_REE2_HP_BITSCRAMBLER : R/W; bitpos: [3]; default: 0;
 *  Configures hp_bitscrambler registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_BITSCRAMBLER    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_BITSCRAMBLER_M  (HP_PERI0_PMS_READ_REE2_HP_BITSCRAMBLER_V << HP_PERI0_PMS_READ_REE2_HP_BITSCRAMBLER_S)
#define HP_PERI0_PMS_READ_REE2_HP_BITSCRAMBLER_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_BITSCRAMBLER_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_BITSCRAMBLER : R/W; bitpos: [4]; default: 1;
 *  Configures hp_bitscrambler registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_BITSCRAMBLER    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_BITSCRAMBLER_M  (HP_PERI0_PMS_WRITE_TEE_HP_BITSCRAMBLER_V << HP_PERI0_PMS_WRITE_TEE_HP_BITSCRAMBLER_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_BITSCRAMBLER_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_BITSCRAMBLER_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_BITSCRAMBLER : R/W; bitpos: [5]; default: 0;
 *  Configures hp_bitscrambler registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_BITSCRAMBLER    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_BITSCRAMBLER_M  (HP_PERI0_PMS_WRITE_REE0_HP_BITSCRAMBLER_V << HP_PERI0_PMS_WRITE_REE0_HP_BITSCRAMBLER_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_BITSCRAMBLER_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_BITSCRAMBLER_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_BITSCRAMBLER : R/W; bitpos: [6]; default: 0;
 *  Configures hp_bitscrambler registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_BITSCRAMBLER    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_BITSCRAMBLER_M  (HP_PERI0_PMS_WRITE_REE1_HP_BITSCRAMBLER_V << HP_PERI0_PMS_WRITE_REE1_HP_BITSCRAMBLER_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_BITSCRAMBLER_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_BITSCRAMBLER_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_BITSCRAMBLER : R/W; bitpos: [7]; default: 0;
 *  Configures hp_bitscrambler registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_BITSCRAMBLER    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_BITSCRAMBLER_M  (HP_PERI0_PMS_WRITE_REE2_HP_BITSCRAMBLER_V << HP_PERI0_PMS_WRITE_REE2_HP_BITSCRAMBLER_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_BITSCRAMBLER_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_BITSCRAMBLER_S  7
/** HP_PERI0_PMS_HP_BITSCRAMBLER_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_bitscrambler peri_apm configuration
 */
#define HP_PERI0_PMS_HP_BITSCRAMBLER_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_BITSCRAMBLER_LOCK_M  (HP_PERI0_PMS_HP_BITSCRAMBLER_LOCK_V << HP_PERI0_PMS_HP_BITSCRAMBLER_LOCK_S)
#define HP_PERI0_PMS_HP_BITSCRAMBLER_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_BITSCRAMBLER_LOCK_S  8

