espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_HP_ASRC_CTRL_REG register
 *  hp_asrc read/write control register
 */
#define HP_PERI0_PMS_HP_ASRC_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x48)
/** HP_PERI0_PMS_READ_TEE_HP_ASRC : R/W; bitpos: [0]; default: 1;
 *  Configures hp_asrc registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_ASRC    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_ASRC_M  (HP_PERI0_PMS_READ_TEE_HP_ASRC_V << HP_PERI0_PMS_READ_TEE_HP_ASRC_S)
#define HP_PERI0_PMS_READ_TEE_HP_ASRC_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_ASRC_S  0
/** HP_PERI0_PMS_READ_REE0_HP_ASRC : R/W; bitpos: [1]; default: 0;
 *  Configures hp_asrc registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_ASRC    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_ASRC_M  (HP_PERI0_PMS_READ_REE0_HP_ASRC_V << HP_PERI0_PMS_READ_REE0_HP_ASRC_S)
#define HP_PERI0_PMS_READ_REE0_HP_ASRC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_ASRC_S  1
/** HP_PERI0_PMS_READ_REE1_HP_ASRC : R/W; bitpos: [2]; default: 0;
 *  Configures hp_asrc registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_ASRC    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_ASRC_M  (HP_PERI0_PMS_READ_REE1_HP_ASRC_V << HP_PERI0_PMS_READ_REE1_HP_ASRC_S)
#define HP_PERI0_PMS_READ_REE1_HP_ASRC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_ASRC_S  2
/** HP_PERI0_PMS_READ_REE2_HP_ASRC : R/W; bitpos: [3]; default: 0;
 *  Configures hp_asrc registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_ASRC    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_ASRC_M  (HP_PERI0_PMS_READ_REE2_HP_ASRC_V << HP_PERI0_PMS_READ_REE2_HP_ASRC_S)
#define HP_PERI0_PMS_READ_REE2_HP_ASRC_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_ASRC_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_ASRC : R/W; bitpos: [4]; default: 1;
 *  Configures hp_asrc registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_ASRC    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_ASRC_M  (HP_PERI0_PMS_WRITE_TEE_HP_ASRC_V << HP_PERI0_PMS_WRITE_TEE_HP_ASRC_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_ASRC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_ASRC_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_ASRC : R/W; bitpos: [5]; default: 0;
 *  Configures hp_asrc registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_ASRC    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_ASRC_M  (HP_PERI0_PMS_WRITE_REE0_HP_ASRC_V << HP_PERI0_PMS_WRITE_REE0_HP_ASRC_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_ASRC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_ASRC_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_ASRC : R/W; bitpos: [6]; default: 0;
 *  Configures hp_asrc registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_ASRC    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_ASRC_M  (HP_PERI0_PMS_WRITE_REE1_HP_ASRC_V << HP_PERI0_PMS_WRITE_REE1_HP_ASRC_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_ASRC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_ASRC_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_ASRC : R/W; bitpos: [7]; default: 0;
 *  Configures hp_asrc registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_ASRC    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_ASRC_M  (HP_PERI0_PMS_WRITE_REE2_HP_ASRC_V << HP_PERI0_PMS_WRITE_REE2_HP_ASRC_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_ASRC_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_ASRC_S  7
/** HP_PERI0_PMS_HP_ASRC_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_asrc peri_apm configuration
 */
#define HP_PERI0_PMS_HP_ASRC_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_ASRC_LOCK_M  (HP_PERI0_PMS_HP_ASRC_LOCK_V << HP_PERI0_PMS_HP_ASRC_LOCK_S)
#define HP_PERI0_PMS_HP_ASRC_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_ASRC_LOCK_S  8

/** HP_PERI0_PMS_CNNT_SYS_REG_CTRL_REG register
 *  cnnt_sys_reg read/write control register
 */
#define HP_PERI0_PMS_CNNT_SYS_REG_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x4c)
/** HP_PERI0_PMS_READ_TEE_CNNT_SYS_REG : R/W; bitpos: [0]; default: 1;
 *  Configures cnnt_sys_reg registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_CNNT_SYS_REG    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_CNNT_SYS_REG_M  (HP_PERI0_PMS_READ_TEE_CNNT_SYS_REG_V << HP_PERI0_PMS_READ_TEE_CNNT_SYS_REG_S)
#define HP_PERI0_PMS_READ_TEE_CNNT_SYS_REG_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_CNNT_SYS_REG_S  0
/** HP_PERI0_PMS_READ_REE0_CNNT_SYS_REG : R/W; bitpos: [1]; default: 0;
 *  Configures cnnt_sys_reg registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_CNNT_SYS_REG    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_CNNT_SYS_REG_M  (HP_PERI0_PMS_READ_REE0_CNNT_SYS_REG_V << HP_PERI0_PMS_READ_REE0_CNNT_SYS_REG_S)
#define HP_PERI0_PMS_READ_REE0_CNNT_SYS_REG_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_CNNT_SYS_REG_S  1
/** HP_PERI0_PMS_READ_REE1_CNNT_SYS_REG : R/W; bitpos: [2]; default: 0;
 *  Configures cnnt_sys_reg registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_CNNT_SYS_REG    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_CNNT_SYS_REG_M  (HP_PERI0_PMS_READ_REE1_CNNT_SYS_REG_V << HP_PERI0_PMS_READ_REE1_CNNT_SYS_REG_S)
#define HP_PERI0_PMS_READ_REE1_CNNT_SYS_REG_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_CNNT_SYS_REG_S  2
/** HP_PERI0_PMS_READ_REE2_CNNT_SYS_REG : R/W; bitpos: [3]; default: 0;
 *  Configures cnnt_sys_reg registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_CNNT_SYS_REG    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_CNNT_SYS_REG_M  (HP_PERI0_PMS_READ_REE2_CNNT_SYS_REG_V << HP_PERI0_PMS_READ_REE2_CNNT_SYS_REG_S)
#define HP_PERI0_PMS_READ_REE2_CNNT_SYS_REG_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_CNNT_SYS_REG_S  3
/** HP_PERI0_PMS_WRITE_TEE_CNNT_SYS_REG : R/W; bitpos: [4]; default: 1;
 *  Configures cnnt_sys_reg registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_CNNT_SYS_REG    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_CNNT_SYS_REG_M  (HP_PERI0_PMS_WRITE_TEE_CNNT_SYS_REG_V << HP_PERI0_PMS_WRITE_TEE_CNNT_SYS_REG_S)
#define HP_PERI0_PMS_WRITE_TEE_CNNT_SYS_REG_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_CNNT_SYS_REG_S  4
/** HP_PERI0_PMS_WRITE_REE0_CNNT_SYS_REG : R/W; bitpos: [5]; default: 0;
 *  Configures cnnt_sys_reg registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_CNNT_SYS_REG    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_CNNT_SYS_REG_M  (HP_PERI0_PMS_WRITE_REE0_CNNT_SYS_REG_V << HP_PERI0_PMS_WRITE_REE0_CNNT_SYS_REG_S)
#define HP_PERI0_PMS_WRITE_REE0_CNNT_SYS_REG_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_CNNT_SYS_REG_S  5
/** HP_PERI0_PMS_WRITE_REE1_CNNT_SYS_REG : R/W; bitpos: [6]; default: 0;
 *  Configures cnnt_sys_reg registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_CNNT_SYS_REG    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_CNNT_SYS_REG_M  (HP_PERI0_PMS_WRITE_REE1_CNNT_SYS_REG_V << HP_PERI0_PMS_WRITE_REE1_CNNT_SYS_REG_S)
#define HP_PERI0_PMS_WRITE_REE1_CNNT_SYS_REG_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_CNNT_SYS_REG_S  6
/** HP_PERI0_PMS_WRITE_REE2_CNNT_SYS_REG : R/W; bitpos: [7]; default: 0;
 *  Configures cnnt_sys_reg registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_CNNT_SYS_REG    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_CNNT_SYS_REG_M  (HP_PERI0_PMS_WRITE_REE2_CNNT_SYS_REG_V << HP_PERI0_PMS_WRITE_REE2_CNNT_SYS_REG_S)
#define HP_PERI0_PMS_WRITE_REE2_CNNT_SYS_REG_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_CNNT_SYS_REG_S  7
/** HP_PERI0_PMS_CNNT_SYS_REG_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock cnnt_sys_reg peri_apm configuration
 */
#define HP_PERI0_PMS_CNNT_SYS_REG_LOCK    (BIT(8))
#define HP_PERI0_PMS_CNNT_SYS_REG_LOCK_M  (HP_PERI0_PMS_CNNT_SYS_REG_LOCK_V << HP_PERI0_PMS_CNNT_SYS_REG_LOCK_S)
#define HP_PERI0_PMS_CNNT_SYS_REG_LOCK_V  0x00000001U
#define HP_PERI0_PMS_CNNT_SYS_REG_LOCK_S  8

/** HP_PERI0_PMS_HP_FLASH_CTRL_REG register
 *  hp_flash read/write control register
 */
#define HP_PERI0_PMS_HP_FLASH_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x50)
/** HP_PERI0_PMS_READ_TEE_HP_FLASH : R/W; bitpos: [0]; default: 1;
 *  Configures hp_flash registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_FLASH    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_FLASH_M  (HP_PERI0_PMS_READ_TEE_HP_FLASH_V << HP_PERI0_PMS_READ_TEE_HP_FLASH_S)
#define HP_PERI0_PMS_READ_TEE_HP_FLASH_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_FLASH_S  0
/** HP_PERI0_PMS_READ_REE0_HP_FLASH : R/W; bitpos: [1]; default: 0;
 *  Configures hp_flash registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_FLASH    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_FLASH_M  (HP_PERI0_PMS_READ_REE0_HP_FLASH_V << HP_PERI0_PMS_READ_REE0_HP_FLASH_S)
#define HP_PERI0_PMS_READ_REE0_HP_FLASH_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_FLASH_S  1
/** HP_PERI0_PMS_READ_REE1_HP_FLASH : R/W; bitpos: [2]; default: 0;
 *  Configures hp_flash registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_FLASH    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_FLASH_M  (HP_PERI0_PMS_READ_REE1_HP_FLASH_V << HP_PERI0_PMS_READ_REE1_HP_FLASH_S)
#define HP_PERI0_PMS_READ_REE1_HP_FLASH_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_FLASH_S  2
/** HP_PERI0_PMS_READ_REE2_HP_FLASH : R/W; bitpos: [3]; default: 0;
 *  Configures hp_flash registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_FLASH    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_FLASH_M  (HP_PERI0_PMS_READ_REE2_HP_FLASH_V << HP_PERI0_PMS_READ_REE2_HP_FLASH_S)
#define HP_PERI0_PMS_READ_REE2_HP_FLASH_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_FLASH_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_FLASH : R/W; bitpos: [4]; default: 1;
 *  Configures hp_flash registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_FLASH    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_FLASH_M  (HP_PERI0_PMS_WRITE_TEE_HP_FLASH_V << HP_PERI0_PMS_WRITE_TEE_HP_FLASH_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_FLASH_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_FLASH_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_FLASH : R/W; bitpos: [5]; default: 0;
 *  Configures hp_flash registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_FLASH    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_FLASH_M  (HP_PERI0_PMS_WRITE_REE0_HP_FLASH_V << HP_PERI0_PMS_WRITE_REE0_HP_FLASH_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_FLASH_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_FLASH_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_FLASH : R/W; bitpos: [6]; default: 0;
 *  Configures hp_flash registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_FLASH    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_FLASH_M  (HP_PERI0_PMS_WRITE_REE1_HP_FLASH_V << HP_PERI0_PMS_WRITE_REE1_HP_FLASH_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_FLASH_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_FLASH_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_FLASH : R/W; bitpos: [7]; default: 0;
 *  Configures hp_flash registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_FLASH    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_FLASH_M  (HP_PERI0_PMS_WRITE_REE2_HP_FLASH_V << HP_PERI0_PMS_WRITE_REE2_HP_FLASH_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_FLASH_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_FLASH_S  7
/** HP_PERI0_PMS_HP_FLASH_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_flash peri_apm configuration
 */
#define HP_PERI0_PMS_HP_FLASH_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_FLASH_LOCK_M  (HP_PERI0_PMS_HP_FLASH_LOCK_V << HP_PERI0_PMS_HP_FLASH_LOCK_S)
#define HP_PERI0_PMS_HP_FLASH_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_FLASH_LOCK_S  8

/** HP_PERI0_PMS_HP_PSRAM_CTRL_REG register
 *  hp_psram read/write control register
 */
#define HP_PERI0_PMS_HP_PSRAM_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x54)
/** HP_PERI0_PMS_READ_TEE_HP_PSRAM : R/W; bitpos: [0]; default: 1;
 *  Configures hp_psram registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_PSRAM    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_PSRAM_M  (HP_PERI0_PMS_READ_TEE_HP_PSRAM_V << HP_PERI0_PMS_READ_TEE_HP_PSRAM_S)
#define HP_PERI0_PMS_READ_TEE_HP_PSRAM_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_PSRAM_S  0
/** HP_PERI0_PMS_READ_REE0_HP_PSRAM : R/W; bitpos: [1]; default: 0;
 *  Configures hp_psram registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_PSRAM    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_PSRAM_M  (HP_PERI0_PMS_READ_REE0_HP_PSRAM_V << HP_PERI0_PMS_READ_REE0_HP_PSRAM_S)
#define HP_PERI0_PMS_READ_REE0_HP_PSRAM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_PSRAM_S  1
/** HP_PERI0_PMS_READ_REE1_HP_PSRAM : R/W; bitpos: [2]; default: 0;
 *  Configures hp_psram registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_PSRAM    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_PSRAM_M  (HP_PERI0_PMS_READ_REE1_HP_PSRAM_V << HP_PERI0_PMS_READ_REE1_HP_PSRAM_S)
#define HP_PERI0_PMS_READ_REE1_HP_PSRAM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_PSRAM_S  2
/** HP_PERI0_PMS_READ_REE2_HP_PSRAM : R/W; bitpos: [3]; default: 0;
 *  Configures hp_psram registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_PSRAM    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_PSRAM_M  (HP_PERI0_PMS_READ_REE2_HP_PSRAM_V << HP_PERI0_PMS_READ_REE2_HP_PSRAM_S)
#define HP_PERI0_PMS_READ_REE2_HP_PSRAM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_PSRAM_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_PSRAM : R/W; bitpos: [4]; default: 1;
 *  Configures hp_psram registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_PSRAM    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_PSRAM_M  (HP_PERI0_PMS_WRITE_TEE_HP_PSRAM_V << HP_PERI0_PMS_WRITE_TEE_HP_PSRAM_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_PSRAM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_PSRAM_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_PSRAM : R/W; bitpos: [5]; default: 0;
 *  Configures hp_psram registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_PSRAM    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_PSRAM_M  (HP_PERI0_PMS_WRITE_REE0_HP_PSRAM_V << HP_PERI0_PMS_WRITE_REE0_HP_PSRAM_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_PSRAM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_PSRAM_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_PSRAM : R/W; bitpos: [6]; default: 0;
 *  Configures hp_psram registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_PSRAM    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_PSRAM_M  (HP_PERI0_PMS_WRITE_REE1_HP_PSRAM_V << HP_PERI0_PMS_WRITE_REE1_HP_PSRAM_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_PSRAM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_PSRAM_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_PSRAM : R/W; bitpos: [7]; default: 0;
 *  Configures hp_psram registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_PSRAM    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_PSRAM_M  (HP_PERI0_PMS_WRITE_REE2_HP_PSRAM_V << HP_PERI0_PMS_WRITE_REE2_HP_PSRAM_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_PSRAM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_PSRAM_S  7
/** HP_PERI0_PMS_HP_PSRAM_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_psram peri_apm configuration
 */
#define HP_PERI0_PMS_HP_PSRAM_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_PSRAM_LOCK_M  (HP_PERI0_PMS_HP_PSRAM_LOCK_V << HP_PERI0_PMS_HP_PSRAM_LOCK_S)
#define HP_PERI0_PMS_HP_PSRAM_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_PSRAM_LOCK_S  8

/** HP_PERI0_PMS_TEE_CTRL_REG register
 *  tee read/write control register
 */
#define HP_PERI0_PMS_TEE_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x58)
/** HP_PERI0_PMS_READ_TEE_TEE : R/W; bitpos: [0]; default: 1;
 *  Configures tee registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_TEE    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_TEE_M  (HP_PERI0_PMS_READ_TEE_TEE_V << HP_PERI0_PMS_READ_TEE_TEE_S)
#define HP_PERI0_PMS_READ_TEE_TEE_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_TEE_S  0
/** HP_PERI0_PMS_READ_REE0_TEE : HRO; bitpos: [1]; default: 0;
 *  Configures tee registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_TEE    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_TEE_M  (HP_PERI0_PMS_READ_REE0_TEE_V << HP_PERI0_PMS_READ_REE0_TEE_S)
#define HP_PERI0_PMS_READ_REE0_TEE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_TEE_S  1
/** HP_PERI0_PMS_READ_REE1_TEE : HRO; bitpos: [2]; default: 0;
 *  Configures tee registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_TEE    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_TEE_M  (HP_PERI0_PMS_READ_REE1_TEE_V << HP_PERI0_PMS_READ_REE1_TEE_S)
#define HP_PERI0_PMS_READ_REE1_TEE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_TEE_S  2
/** HP_PERI0_PMS_READ_REE2_TEE : HRO; bitpos: [3]; default: 0;
 *  Configures tee registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_TEE    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_TEE_M  (HP_PERI0_PMS_READ_REE2_TEE_V << HP_PERI0_PMS_READ_REE2_TEE_S)
#define HP_PERI0_PMS_READ_REE2_TEE_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_TEE_S  3
/** HP_PERI0_PMS_WRITE_TEE_TEE : R/W; bitpos: [4]; default: 1;
 *  Configures tee registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_TEE    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_TEE_M  (HP_PERI0_PMS_WRITE_TEE_TEE_V << HP_PERI0_PMS_WRITE_TEE_TEE_S)
#define HP_PERI0_PMS_WRITE_TEE_TEE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_TEE_S  4
/** HP_PERI0_PMS_WRITE_REE0_TEE : HRO; bitpos: [5]; default: 0;
 *  Configures tee registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_TEE    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_TEE_M  (HP_PERI0_PMS_WRITE_REE0_TEE_V << HP_PERI0_PMS_WRITE_REE0_TEE_S)
#define HP_PERI0_PMS_WRITE_REE0_TEE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_TEE_S  5
/** HP_PERI0_PMS_WRITE_REE1_TEE : HRO; bitpos: [6]; default: 0;
 *  Configures tee registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_TEE    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_TEE_M  (HP_PERI0_PMS_WRITE_REE1_TEE_V << HP_PERI0_PMS_WRITE_REE1_TEE_S)
#define HP_PERI0_PMS_WRITE_REE1_TEE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_TEE_S  6
/** HP_PERI0_PMS_WRITE_REE2_TEE : HRO; bitpos: [7]; default: 0;
 *  Configures tee registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_TEE    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_TEE_M  (HP_PERI0_PMS_WRITE_REE2_TEE_V << HP_PERI0_PMS_WRITE_REE2_TEE_S)
#define HP_PERI0_PMS_WRITE_REE2_TEE_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_TEE_S  7
/** HP_PERI0_PMS_TEE_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock tee peri_apm configuration
 */
#define HP_PERI0_PMS_TEE_LOCK    (BIT(8))
#define HP_PERI0_PMS_TEE_LOCK_M  (HP_PERI0_PMS_TEE_LOCK_V << HP_PERI0_PMS_TEE_LOCK_S)
#define HP_PERI0_PMS_TEE_LOCK_V  0x00000001U
#define HP_PERI0_PMS_TEE_LOCK_S  8

