espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_HP_APM_CTRL_REG register
 *  hp_apm read/write control register
 */
#define HP_PERI0_PMS_HP_APM_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x5c)
/** HP_PERI0_PMS_READ_TEE_HP_APM : R/W; bitpos: [0]; default: 1;
 *  Configures hp_apm registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_APM    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_APM_M  (HP_PERI0_PMS_READ_TEE_HP_APM_V << HP_PERI0_PMS_READ_TEE_HP_APM_S)
#define HP_PERI0_PMS_READ_TEE_HP_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_APM_S  0
/** HP_PERI0_PMS_READ_REE0_HP_APM : HRO; bitpos: [1]; default: 0;
 *  Configures hp_apm registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_APM    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_APM_M  (HP_PERI0_PMS_READ_REE0_HP_APM_V << HP_PERI0_PMS_READ_REE0_HP_APM_S)
#define HP_PERI0_PMS_READ_REE0_HP_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_APM_S  1
/** HP_PERI0_PMS_READ_REE1_HP_APM : HRO; bitpos: [2]; default: 0;
 *  Configures hp_apm registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_APM    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_APM_M  (HP_PERI0_PMS_READ_REE1_HP_APM_V << HP_PERI0_PMS_READ_REE1_HP_APM_S)
#define HP_PERI0_PMS_READ_REE1_HP_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_APM_S  2
/** HP_PERI0_PMS_READ_REE2_HP_APM : HRO; bitpos: [3]; default: 0;
 *  Configures hp_apm registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_APM    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_APM_M  (HP_PERI0_PMS_READ_REE2_HP_APM_V << HP_PERI0_PMS_READ_REE2_HP_APM_S)
#define HP_PERI0_PMS_READ_REE2_HP_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_APM_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_APM : R/W; bitpos: [4]; default: 1;
 *  Configures hp_apm registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_APM    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_APM_M  (HP_PERI0_PMS_WRITE_TEE_HP_APM_V << HP_PERI0_PMS_WRITE_TEE_HP_APM_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_APM_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_APM : HRO; bitpos: [5]; default: 0;
 *  Configures hp_apm registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_APM    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_APM_M  (HP_PERI0_PMS_WRITE_REE0_HP_APM_V << HP_PERI0_PMS_WRITE_REE0_HP_APM_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_APM_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_APM : HRO; bitpos: [6]; default: 0;
 *  Configures hp_apm registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_APM    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_APM_M  (HP_PERI0_PMS_WRITE_REE1_HP_APM_V << HP_PERI0_PMS_WRITE_REE1_HP_APM_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_APM_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_APM : HRO; bitpos: [7]; default: 0;
 *  Configures hp_apm registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_APM    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_APM_M  (HP_PERI0_PMS_WRITE_REE2_HP_APM_V << HP_PERI0_PMS_WRITE_REE2_HP_APM_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_APM_S  7
/** HP_PERI0_PMS_HP_APM_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_apm peri_apm configuration
 */
#define HP_PERI0_PMS_HP_APM_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_APM_LOCK_M  (HP_PERI0_PMS_HP_APM_LOCK_V << HP_PERI0_PMS_HP_APM_LOCK_S)
#define HP_PERI0_PMS_HP_APM_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_APM_LOCK_S  8

/** HP_PERI0_PMS_HP_MEM_APM_CTRL_REG register
 *  hp_mem_apm read/write control register
 */
#define HP_PERI0_PMS_HP_MEM_APM_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x60)
/** HP_PERI0_PMS_READ_TEE_HP_MEM_APM : R/W; bitpos: [0]; default: 1;
 *  Configures hp_mem_apm registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_MEM_APM    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_MEM_APM_M  (HP_PERI0_PMS_READ_TEE_HP_MEM_APM_V << HP_PERI0_PMS_READ_TEE_HP_MEM_APM_S)
#define HP_PERI0_PMS_READ_TEE_HP_MEM_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_MEM_APM_S  0
/** HP_PERI0_PMS_READ_REE0_HP_MEM_APM : HRO; bitpos: [1]; default: 0;
 *  Configures hp_mem_apm registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_MEM_APM    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_MEM_APM_M  (HP_PERI0_PMS_READ_REE0_HP_MEM_APM_V << HP_PERI0_PMS_READ_REE0_HP_MEM_APM_S)
#define HP_PERI0_PMS_READ_REE0_HP_MEM_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_MEM_APM_S  1
/** HP_PERI0_PMS_READ_REE1_HP_MEM_APM : HRO; bitpos: [2]; default: 0;
 *  Configures hp_mem_apm registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_MEM_APM    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_MEM_APM_M  (HP_PERI0_PMS_READ_REE1_HP_MEM_APM_V << HP_PERI0_PMS_READ_REE1_HP_MEM_APM_S)
#define HP_PERI0_PMS_READ_REE1_HP_MEM_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_MEM_APM_S  2
/** HP_PERI0_PMS_READ_REE2_HP_MEM_APM : HRO; bitpos: [3]; default: 0;
 *  Configures hp_mem_apm registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_MEM_APM    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_MEM_APM_M  (HP_PERI0_PMS_READ_REE2_HP_MEM_APM_V << HP_PERI0_PMS_READ_REE2_HP_MEM_APM_S)
#define HP_PERI0_PMS_READ_REE2_HP_MEM_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_MEM_APM_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_MEM_APM : R/W; bitpos: [4]; default: 1;
 *  Configures hp_mem_apm registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_MEM_APM    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_MEM_APM_M  (HP_PERI0_PMS_WRITE_TEE_HP_MEM_APM_V << HP_PERI0_PMS_WRITE_TEE_HP_MEM_APM_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_MEM_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_MEM_APM_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_MEM_APM : HRO; bitpos: [5]; default: 0;
 *  Configures hp_mem_apm registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_MEM_APM    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_MEM_APM_M  (HP_PERI0_PMS_WRITE_REE0_HP_MEM_APM_V << HP_PERI0_PMS_WRITE_REE0_HP_MEM_APM_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_MEM_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_MEM_APM_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_MEM_APM : HRO; bitpos: [6]; default: 0;
 *  Configures hp_mem_apm registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_MEM_APM    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_MEM_APM_M  (HP_PERI0_PMS_WRITE_REE1_HP_MEM_APM_V << HP_PERI0_PMS_WRITE_REE1_HP_MEM_APM_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_MEM_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_MEM_APM_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_MEM_APM : HRO; bitpos: [7]; default: 0;
 *  Configures hp_mem_apm registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_MEM_APM    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_MEM_APM_M  (HP_PERI0_PMS_WRITE_REE2_HP_MEM_APM_V << HP_PERI0_PMS_WRITE_REE2_HP_MEM_APM_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_MEM_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_MEM_APM_S  7
/** HP_PERI0_PMS_HP_MEM_APM_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_mem_apm peri_apm configuration
 */
#define HP_PERI0_PMS_HP_MEM_APM_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_MEM_APM_LOCK_M  (HP_PERI0_PMS_HP_MEM_APM_LOCK_V << HP_PERI0_PMS_HP_MEM_APM_LOCK_S)
#define HP_PERI0_PMS_HP_MEM_APM_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_MEM_APM_LOCK_S  8

/** HP_PERI0_PMS_CPU_APM_CTRL_REG register
 *  cpu_apm read/write control register
 */
#define HP_PERI0_PMS_CPU_APM_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x64)
/** HP_PERI0_PMS_READ_TEE_CPU_APM : R/W; bitpos: [0]; default: 1;
 *  Configures cpu_apm registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_CPU_APM    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_CPU_APM_M  (HP_PERI0_PMS_READ_TEE_CPU_APM_V << HP_PERI0_PMS_READ_TEE_CPU_APM_S)
#define HP_PERI0_PMS_READ_TEE_CPU_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_CPU_APM_S  0
/** HP_PERI0_PMS_READ_REE0_CPU_APM : HRO; bitpos: [1]; default: 0;
 *  Configures cpu_apm registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_CPU_APM    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_CPU_APM_M  (HP_PERI0_PMS_READ_REE0_CPU_APM_V << HP_PERI0_PMS_READ_REE0_CPU_APM_S)
#define HP_PERI0_PMS_READ_REE0_CPU_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_CPU_APM_S  1
/** HP_PERI0_PMS_READ_REE1_CPU_APM : HRO; bitpos: [2]; default: 0;
 *  Configures cpu_apm registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_CPU_APM    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_CPU_APM_M  (HP_PERI0_PMS_READ_REE1_CPU_APM_V << HP_PERI0_PMS_READ_REE1_CPU_APM_S)
#define HP_PERI0_PMS_READ_REE1_CPU_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_CPU_APM_S  2
/** HP_PERI0_PMS_READ_REE2_CPU_APM : HRO; bitpos: [3]; default: 0;
 *  Configures cpu_apm registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_CPU_APM    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_CPU_APM_M  (HP_PERI0_PMS_READ_REE2_CPU_APM_V << HP_PERI0_PMS_READ_REE2_CPU_APM_S)
#define HP_PERI0_PMS_READ_REE2_CPU_APM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_CPU_APM_S  3
/** HP_PERI0_PMS_WRITE_TEE_CPU_APM : R/W; bitpos: [4]; default: 1;
 *  Configures cpu_apm registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_CPU_APM    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_CPU_APM_M  (HP_PERI0_PMS_WRITE_TEE_CPU_APM_V << HP_PERI0_PMS_WRITE_TEE_CPU_APM_S)
#define HP_PERI0_PMS_WRITE_TEE_CPU_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_CPU_APM_S  4
/** HP_PERI0_PMS_WRITE_REE0_CPU_APM : HRO; bitpos: [5]; default: 0;
 *  Configures cpu_apm registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_CPU_APM    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_CPU_APM_M  (HP_PERI0_PMS_WRITE_REE0_CPU_APM_V << HP_PERI0_PMS_WRITE_REE0_CPU_APM_S)
#define HP_PERI0_PMS_WRITE_REE0_CPU_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_CPU_APM_S  5
/** HP_PERI0_PMS_WRITE_REE1_CPU_APM : HRO; bitpos: [6]; default: 0;
 *  Configures cpu_apm registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_CPU_APM    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_CPU_APM_M  (HP_PERI0_PMS_WRITE_REE1_CPU_APM_V << HP_PERI0_PMS_WRITE_REE1_CPU_APM_S)
#define HP_PERI0_PMS_WRITE_REE1_CPU_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_CPU_APM_S  6
/** HP_PERI0_PMS_WRITE_REE2_CPU_APM : HRO; bitpos: [7]; default: 0;
 *  Configures cpu_apm registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_CPU_APM    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_CPU_APM_M  (HP_PERI0_PMS_WRITE_REE2_CPU_APM_V << HP_PERI0_PMS_WRITE_REE2_CPU_APM_S)
#define HP_PERI0_PMS_WRITE_REE2_CPU_APM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_CPU_APM_S  7
/** HP_PERI0_PMS_CPU_APM_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock cpu_apm peri_apm configuration
 */
#define HP_PERI0_PMS_CPU_APM_LOCK    (BIT(8))
#define HP_PERI0_PMS_CPU_APM_LOCK_M  (HP_PERI0_PMS_CPU_APM_LOCK_V << HP_PERI0_PMS_CPU_APM_LOCK_S)
#define HP_PERI0_PMS_CPU_APM_LOCK_V  0x00000001U
#define HP_PERI0_PMS_CPU_APM_LOCK_S  8

/** HP_PERI0_PMS_HP_PERI0_PMS_CTRL_REG register
 *  hp_peri0_pms read/write control register
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x68)
/** HP_PERI0_PMS_READ_TEE_HP_PERI0_PMS : R/W; bitpos: [0]; default: 1;
 *  Configures hp_peri0_pms registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_PERI0_PMS    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_PERI0_PMS_M  (HP_PERI0_PMS_READ_TEE_HP_PERI0_PMS_V << HP_PERI0_PMS_READ_TEE_HP_PERI0_PMS_S)
#define HP_PERI0_PMS_READ_TEE_HP_PERI0_PMS_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_PERI0_PMS_S  0
/** HP_PERI0_PMS_READ_REE0_HP_PERI0_PMS : HRO; bitpos: [1]; default: 0;
 *  Configures hp_peri0_pms registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_PERI0_PMS    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_PERI0_PMS_M  (HP_PERI0_PMS_READ_REE0_HP_PERI0_PMS_V << HP_PERI0_PMS_READ_REE0_HP_PERI0_PMS_S)
#define HP_PERI0_PMS_READ_REE0_HP_PERI0_PMS_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_PERI0_PMS_S  1
/** HP_PERI0_PMS_READ_REE1_HP_PERI0_PMS : HRO; bitpos: [2]; default: 0;
 *  Configures hp_peri0_pms registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_PERI0_PMS    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_PERI0_PMS_M  (HP_PERI0_PMS_READ_REE1_HP_PERI0_PMS_V << HP_PERI0_PMS_READ_REE1_HP_PERI0_PMS_S)
#define HP_PERI0_PMS_READ_REE1_HP_PERI0_PMS_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_PERI0_PMS_S  2
/** HP_PERI0_PMS_READ_REE2_HP_PERI0_PMS : HRO; bitpos: [3]; default: 0;
 *  Configures hp_peri0_pms registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_PERI0_PMS    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_PERI0_PMS_M  (HP_PERI0_PMS_READ_REE2_HP_PERI0_PMS_V << HP_PERI0_PMS_READ_REE2_HP_PERI0_PMS_S)
#define HP_PERI0_PMS_READ_REE2_HP_PERI0_PMS_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_PERI0_PMS_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_PERI0_PMS : R/W; bitpos: [4]; default: 1;
 *  Configures hp_peri0_pms registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_PERI0_PMS    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_PERI0_PMS_M  (HP_PERI0_PMS_WRITE_TEE_HP_PERI0_PMS_V << HP_PERI0_PMS_WRITE_TEE_HP_PERI0_PMS_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_PERI0_PMS_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_PERI0_PMS_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_PERI0_PMS : HRO; bitpos: [5]; default: 0;
 *  Configures hp_peri0_pms registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_PERI0_PMS    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_PERI0_PMS_M  (HP_PERI0_PMS_WRITE_REE0_HP_PERI0_PMS_V << HP_PERI0_PMS_WRITE_REE0_HP_PERI0_PMS_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_PERI0_PMS_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_PERI0_PMS_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_PERI0_PMS : HRO; bitpos: [6]; default: 0;
 *  Configures hp_peri0_pms registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_PERI0_PMS    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_PERI0_PMS_M  (HP_PERI0_PMS_WRITE_REE1_HP_PERI0_PMS_V << HP_PERI0_PMS_WRITE_REE1_HP_PERI0_PMS_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_PERI0_PMS_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_PERI0_PMS_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_PERI0_PMS : HRO; bitpos: [7]; default: 0;
 *  Configures hp_peri0_pms registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_PERI0_PMS    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_PERI0_PMS_M  (HP_PERI0_PMS_WRITE_REE2_HP_PERI0_PMS_V << HP_PERI0_PMS_WRITE_REE2_HP_PERI0_PMS_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_PERI0_PMS_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_PERI0_PMS_S  7
/** HP_PERI0_PMS_HP_PERI0_PMS_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_peri0_pms peri_apm configuration
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_PERI0_PMS_LOCK_M  (HP_PERI0_PMS_HP_PERI0_PMS_LOCK_V << HP_PERI0_PMS_HP_PERI0_PMS_LOCK_S)
#define HP_PERI0_PMS_HP_PERI0_PMS_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_PERI0_PMS_LOCK_S  8

