espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_HP_KEY_MANAGER_CTRL_REG register
 *  hp_key_manager read/write control register
 */
#define HP_PERI0_PMS_HP_KEY_MANAGER_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x6c)
/** HP_PERI0_PMS_READ_TEE_HP_KEY_MANAGER : R/W; bitpos: [0]; default: 1;
 *  Configures hp_key_manager registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_KEY_MANAGER    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_KEY_MANAGER_M  (HP_PERI0_PMS_READ_TEE_HP_KEY_MANAGER_V << HP_PERI0_PMS_READ_TEE_HP_KEY_MANAGER_S)
#define HP_PERI0_PMS_READ_TEE_HP_KEY_MANAGER_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_KEY_MANAGER_S  0
/** HP_PERI0_PMS_READ_REE0_HP_KEY_MANAGER : R/W; bitpos: [1]; default: 0;
 *  Configures hp_key_manager registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_KEY_MANAGER    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_KEY_MANAGER_M  (HP_PERI0_PMS_READ_REE0_HP_KEY_MANAGER_V << HP_PERI0_PMS_READ_REE0_HP_KEY_MANAGER_S)
#define HP_PERI0_PMS_READ_REE0_HP_KEY_MANAGER_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_KEY_MANAGER_S  1
/** HP_PERI0_PMS_READ_REE1_HP_KEY_MANAGER : R/W; bitpos: [2]; default: 0;
 *  Configures hp_key_manager registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_KEY_MANAGER    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_KEY_MANAGER_M  (HP_PERI0_PMS_READ_REE1_HP_KEY_MANAGER_V << HP_PERI0_PMS_READ_REE1_HP_KEY_MANAGER_S)
#define HP_PERI0_PMS_READ_REE1_HP_KEY_MANAGER_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_KEY_MANAGER_S  2
/** HP_PERI0_PMS_READ_REE2_HP_KEY_MANAGER : R/W; bitpos: [3]; default: 0;
 *  Configures hp_key_manager registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_KEY_MANAGER    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_KEY_MANAGER_M  (HP_PERI0_PMS_READ_REE2_HP_KEY_MANAGER_V << HP_PERI0_PMS_READ_REE2_HP_KEY_MANAGER_S)
#define HP_PERI0_PMS_READ_REE2_HP_KEY_MANAGER_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_KEY_MANAGER_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_KEY_MANAGER : R/W; bitpos: [4]; default: 1;
 *  Configures hp_key_manager registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_KEY_MANAGER    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_KEY_MANAGER_M  (HP_PERI0_PMS_WRITE_TEE_HP_KEY_MANAGER_V << HP_PERI0_PMS_WRITE_TEE_HP_KEY_MANAGER_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_KEY_MANAGER_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_KEY_MANAGER_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_KEY_MANAGER : R/W; bitpos: [5]; default: 0;
 *  Configures hp_key_manager registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_KEY_MANAGER    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_KEY_MANAGER_M  (HP_PERI0_PMS_WRITE_REE0_HP_KEY_MANAGER_V << HP_PERI0_PMS_WRITE_REE0_HP_KEY_MANAGER_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_KEY_MANAGER_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_KEY_MANAGER_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_KEY_MANAGER : R/W; bitpos: [6]; default: 0;
 *  Configures hp_key_manager registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_KEY_MANAGER    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_KEY_MANAGER_M  (HP_PERI0_PMS_WRITE_REE1_HP_KEY_MANAGER_V << HP_PERI0_PMS_WRITE_REE1_HP_KEY_MANAGER_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_KEY_MANAGER_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_KEY_MANAGER_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_KEY_MANAGER : R/W; bitpos: [7]; default: 0;
 *  Configures hp_key_manager registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_KEY_MANAGER    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_KEY_MANAGER_M  (HP_PERI0_PMS_WRITE_REE2_HP_KEY_MANAGER_V << HP_PERI0_PMS_WRITE_REE2_HP_KEY_MANAGER_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_KEY_MANAGER_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_KEY_MANAGER_S  7
/** HP_PERI0_PMS_HP_KEY_MANAGER_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_key_manager peri_apm configuration
 */
#define HP_PERI0_PMS_HP_KEY_MANAGER_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_KEY_MANAGER_LOCK_M  (HP_PERI0_PMS_HP_KEY_MANAGER_LOCK_V << HP_PERI0_PMS_HP_KEY_MANAGER_LOCK_S)
#define HP_PERI0_PMS_HP_KEY_MANAGER_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_KEY_MANAGER_LOCK_S  8

/** HP_PERI0_PMS_HP_CRYPTO_CTRL_REG register
 *  hp_crypto read/write control register
 */
#define HP_PERI0_PMS_HP_CRYPTO_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x70)
/** HP_PERI0_PMS_READ_TEE_HP_CRYPTO : R/W; bitpos: [0]; default: 1;
 *  Configures hp_crypto registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_CRYPTO    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_CRYPTO_M  (HP_PERI0_PMS_READ_TEE_HP_CRYPTO_V << HP_PERI0_PMS_READ_TEE_HP_CRYPTO_S)
#define HP_PERI0_PMS_READ_TEE_HP_CRYPTO_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_CRYPTO_S  0
/** HP_PERI0_PMS_READ_REE0_HP_CRYPTO : R/W; bitpos: [1]; default: 0;
 *  Configures hp_crypto registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_CRYPTO    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_CRYPTO_M  (HP_PERI0_PMS_READ_REE0_HP_CRYPTO_V << HP_PERI0_PMS_READ_REE0_HP_CRYPTO_S)
#define HP_PERI0_PMS_READ_REE0_HP_CRYPTO_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_CRYPTO_S  1
/** HP_PERI0_PMS_READ_REE1_HP_CRYPTO : R/W; bitpos: [2]; default: 0;
 *  Configures hp_crypto registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_CRYPTO    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_CRYPTO_M  (HP_PERI0_PMS_READ_REE1_HP_CRYPTO_V << HP_PERI0_PMS_READ_REE1_HP_CRYPTO_S)
#define HP_PERI0_PMS_READ_REE1_HP_CRYPTO_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_CRYPTO_S  2
/** HP_PERI0_PMS_READ_REE2_HP_CRYPTO : R/W; bitpos: [3]; default: 0;
 *  Configures hp_crypto registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_CRYPTO    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_CRYPTO_M  (HP_PERI0_PMS_READ_REE2_HP_CRYPTO_V << HP_PERI0_PMS_READ_REE2_HP_CRYPTO_S)
#define HP_PERI0_PMS_READ_REE2_HP_CRYPTO_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_CRYPTO_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_CRYPTO : R/W; bitpos: [4]; default: 1;
 *  Configures hp_crypto registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_CRYPTO    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_CRYPTO_M  (HP_PERI0_PMS_WRITE_TEE_HP_CRYPTO_V << HP_PERI0_PMS_WRITE_TEE_HP_CRYPTO_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_CRYPTO_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_CRYPTO_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_CRYPTO : R/W; bitpos: [5]; default: 0;
 *  Configures hp_crypto registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_CRYPTO    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_CRYPTO_M  (HP_PERI0_PMS_WRITE_REE0_HP_CRYPTO_V << HP_PERI0_PMS_WRITE_REE0_HP_CRYPTO_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_CRYPTO_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_CRYPTO_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_CRYPTO : R/W; bitpos: [6]; default: 0;
 *  Configures hp_crypto registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_CRYPTO    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_CRYPTO_M  (HP_PERI0_PMS_WRITE_REE1_HP_CRYPTO_V << HP_PERI0_PMS_WRITE_REE1_HP_CRYPTO_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_CRYPTO_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_CRYPTO_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_CRYPTO : R/W; bitpos: [7]; default: 0;
 *  Configures hp_crypto registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_CRYPTO    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_CRYPTO_M  (HP_PERI0_PMS_WRITE_REE2_HP_CRYPTO_V << HP_PERI0_PMS_WRITE_REE2_HP_CRYPTO_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_CRYPTO_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_CRYPTO_S  7
/** HP_PERI0_PMS_HP_CRYPTO_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_crypto peri_apm configuration
 */
#define HP_PERI0_PMS_HP_CRYPTO_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_CRYPTO_LOCK_M  (HP_PERI0_PMS_HP_CRYPTO_LOCK_V << HP_PERI0_PMS_HP_CRYPTO_LOCK_S)
#define HP_PERI0_PMS_HP_CRYPTO_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_CRYPTO_LOCK_S  8

/** HP_PERI0_PMS_HP_AXI_ICM_CTRL_REG register
 *  hp_axi_icm read/write control register
 */
#define HP_PERI0_PMS_HP_AXI_ICM_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x74)
/** HP_PERI0_PMS_READ_TEE_HP_AXI_ICM : R/W; bitpos: [0]; default: 1;
 *  Configures hp_axi_icm registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_HP_AXI_ICM    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_HP_AXI_ICM_M  (HP_PERI0_PMS_READ_TEE_HP_AXI_ICM_V << HP_PERI0_PMS_READ_TEE_HP_AXI_ICM_S)
#define HP_PERI0_PMS_READ_TEE_HP_AXI_ICM_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_HP_AXI_ICM_S  0
/** HP_PERI0_PMS_READ_REE0_HP_AXI_ICM : R/W; bitpos: [1]; default: 0;
 *  Configures hp_axi_icm registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_HP_AXI_ICM    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_HP_AXI_ICM_M  (HP_PERI0_PMS_READ_REE0_HP_AXI_ICM_V << HP_PERI0_PMS_READ_REE0_HP_AXI_ICM_S)
#define HP_PERI0_PMS_READ_REE0_HP_AXI_ICM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_HP_AXI_ICM_S  1
/** HP_PERI0_PMS_READ_REE1_HP_AXI_ICM : R/W; bitpos: [2]; default: 0;
 *  Configures hp_axi_icm registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_HP_AXI_ICM    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_HP_AXI_ICM_M  (HP_PERI0_PMS_READ_REE1_HP_AXI_ICM_V << HP_PERI0_PMS_READ_REE1_HP_AXI_ICM_S)
#define HP_PERI0_PMS_READ_REE1_HP_AXI_ICM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_HP_AXI_ICM_S  2
/** HP_PERI0_PMS_READ_REE2_HP_AXI_ICM : R/W; bitpos: [3]; default: 0;
 *  Configures hp_axi_icm registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_HP_AXI_ICM    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_HP_AXI_ICM_M  (HP_PERI0_PMS_READ_REE2_HP_AXI_ICM_V << HP_PERI0_PMS_READ_REE2_HP_AXI_ICM_S)
#define HP_PERI0_PMS_READ_REE2_HP_AXI_ICM_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_HP_AXI_ICM_S  3
/** HP_PERI0_PMS_WRITE_TEE_HP_AXI_ICM : R/W; bitpos: [4]; default: 1;
 *  Configures hp_axi_icm registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_HP_AXI_ICM    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_HP_AXI_ICM_M  (HP_PERI0_PMS_WRITE_TEE_HP_AXI_ICM_V << HP_PERI0_PMS_WRITE_TEE_HP_AXI_ICM_S)
#define HP_PERI0_PMS_WRITE_TEE_HP_AXI_ICM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_HP_AXI_ICM_S  4
/** HP_PERI0_PMS_WRITE_REE0_HP_AXI_ICM : R/W; bitpos: [5]; default: 0;
 *  Configures hp_axi_icm registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_HP_AXI_ICM    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_HP_AXI_ICM_M  (HP_PERI0_PMS_WRITE_REE0_HP_AXI_ICM_V << HP_PERI0_PMS_WRITE_REE0_HP_AXI_ICM_S)
#define HP_PERI0_PMS_WRITE_REE0_HP_AXI_ICM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_HP_AXI_ICM_S  5
/** HP_PERI0_PMS_WRITE_REE1_HP_AXI_ICM : R/W; bitpos: [6]; default: 0;
 *  Configures hp_axi_icm registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_HP_AXI_ICM    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_HP_AXI_ICM_M  (HP_PERI0_PMS_WRITE_REE1_HP_AXI_ICM_V << HP_PERI0_PMS_WRITE_REE1_HP_AXI_ICM_S)
#define HP_PERI0_PMS_WRITE_REE1_HP_AXI_ICM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_HP_AXI_ICM_S  6
/** HP_PERI0_PMS_WRITE_REE2_HP_AXI_ICM : R/W; bitpos: [7]; default: 0;
 *  Configures hp_axi_icm registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_HP_AXI_ICM    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_HP_AXI_ICM_M  (HP_PERI0_PMS_WRITE_REE2_HP_AXI_ICM_V << HP_PERI0_PMS_WRITE_REE2_HP_AXI_ICM_S)
#define HP_PERI0_PMS_WRITE_REE2_HP_AXI_ICM_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_HP_AXI_ICM_S  7
/** HP_PERI0_PMS_HP_AXI_ICM_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock hp_axi_icm peri_apm configuration
 */
#define HP_PERI0_PMS_HP_AXI_ICM_LOCK    (BIT(8))
#define HP_PERI0_PMS_HP_AXI_ICM_LOCK_M  (HP_PERI0_PMS_HP_AXI_ICM_LOCK_V << HP_PERI0_PMS_HP_AXI_ICM_LOCK_S)
#define HP_PERI0_PMS_HP_AXI_ICM_LOCK_V  0x00000001U
#define HP_PERI0_PMS_HP_AXI_ICM_LOCK_S  8

