espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_AXI_PERF_MON_CTRL_REG register
 *  axi_perf_mon read/write control register
 */
#define HP_PERI0_PMS_AXI_PERF_MON_CTRL_REG (DR_REG_HP_PERI0_PMS_BASE + 0x78)
/** HP_PERI0_PMS_READ_TEE_AXI_PERF_MON : R/W; bitpos: [0]; default: 1;
 *  Configures axi_perf_mon registers read permission in tee mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_TEE_AXI_PERF_MON    (BIT(0))
#define HP_PERI0_PMS_READ_TEE_AXI_PERF_MON_M  (HP_PERI0_PMS_READ_TEE_AXI_PERF_MON_V << HP_PERI0_PMS_READ_TEE_AXI_PERF_MON_S)
#define HP_PERI0_PMS_READ_TEE_AXI_PERF_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_TEE_AXI_PERF_MON_S  0
/** HP_PERI0_PMS_READ_REE0_AXI_PERF_MON : R/W; bitpos: [1]; default: 0;
 *  Configures axi_perf_mon registers read permission in ree0 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE0_AXI_PERF_MON    (BIT(1))
#define HP_PERI0_PMS_READ_REE0_AXI_PERF_MON_M  (HP_PERI0_PMS_READ_REE0_AXI_PERF_MON_V << HP_PERI0_PMS_READ_REE0_AXI_PERF_MON_S)
#define HP_PERI0_PMS_READ_REE0_AXI_PERF_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE0_AXI_PERF_MON_S  1
/** HP_PERI0_PMS_READ_REE1_AXI_PERF_MON : R/W; bitpos: [2]; default: 0;
 *  Configures axi_perf_mon registers read permission in ree1 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE1_AXI_PERF_MON    (BIT(2))
#define HP_PERI0_PMS_READ_REE1_AXI_PERF_MON_M  (HP_PERI0_PMS_READ_REE1_AXI_PERF_MON_V << HP_PERI0_PMS_READ_REE1_AXI_PERF_MON_S)
#define HP_PERI0_PMS_READ_REE1_AXI_PERF_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE1_AXI_PERF_MON_S  2
/** HP_PERI0_PMS_READ_REE2_AXI_PERF_MON : R/W; bitpos: [3]; default: 0;
 *  Configures axi_perf_mon registers read permission in ree2 mode.
 *  0: can not be read
 *  1: can be read
 */
#define HP_PERI0_PMS_READ_REE2_AXI_PERF_MON    (BIT(3))
#define HP_PERI0_PMS_READ_REE2_AXI_PERF_MON_M  (HP_PERI0_PMS_READ_REE2_AXI_PERF_MON_V << HP_PERI0_PMS_READ_REE2_AXI_PERF_MON_S)
#define HP_PERI0_PMS_READ_REE2_AXI_PERF_MON_V  0x00000001U
#define HP_PERI0_PMS_READ_REE2_AXI_PERF_MON_S  3
/** HP_PERI0_PMS_WRITE_TEE_AXI_PERF_MON : R/W; bitpos: [4]; default: 1;
 *  Configures axi_perf_mon registers write permission in tee mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_TEE_AXI_PERF_MON    (BIT(4))
#define HP_PERI0_PMS_WRITE_TEE_AXI_PERF_MON_M  (HP_PERI0_PMS_WRITE_TEE_AXI_PERF_MON_V << HP_PERI0_PMS_WRITE_TEE_AXI_PERF_MON_S)
#define HP_PERI0_PMS_WRITE_TEE_AXI_PERF_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_TEE_AXI_PERF_MON_S  4
/** HP_PERI0_PMS_WRITE_REE0_AXI_PERF_MON : R/W; bitpos: [5]; default: 0;
 *  Configures axi_perf_mon registers write permission in ree0 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE0_AXI_PERF_MON    (BIT(5))
#define HP_PERI0_PMS_WRITE_REE0_AXI_PERF_MON_M  (HP_PERI0_PMS_WRITE_REE0_AXI_PERF_MON_V << HP_PERI0_PMS_WRITE_REE0_AXI_PERF_MON_S)
#define HP_PERI0_PMS_WRITE_REE0_AXI_PERF_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE0_AXI_PERF_MON_S  5
/** HP_PERI0_PMS_WRITE_REE1_AXI_PERF_MON : R/W; bitpos: [6]; default: 0;
 *  Configures axi_perf_mon registers write permission in ree1 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE1_AXI_PERF_MON    (BIT(6))
#define HP_PERI0_PMS_WRITE_REE1_AXI_PERF_MON_M  (HP_PERI0_PMS_WRITE_REE1_AXI_PERF_MON_V << HP_PERI0_PMS_WRITE_REE1_AXI_PERF_MON_S)
#define HP_PERI0_PMS_WRITE_REE1_AXI_PERF_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE1_AXI_PERF_MON_S  6
/** HP_PERI0_PMS_WRITE_REE2_AXI_PERF_MON : R/W; bitpos: [7]; default: 0;
 *  Configures axi_perf_mon registers write permission in ree2 mode.
 *  0: can not be write
 *  1: can be write
 */
#define HP_PERI0_PMS_WRITE_REE2_AXI_PERF_MON    (BIT(7))
#define HP_PERI0_PMS_WRITE_REE2_AXI_PERF_MON_M  (HP_PERI0_PMS_WRITE_REE2_AXI_PERF_MON_V << HP_PERI0_PMS_WRITE_REE2_AXI_PERF_MON_S)
#define HP_PERI0_PMS_WRITE_REE2_AXI_PERF_MON_V  0x00000001U
#define HP_PERI0_PMS_WRITE_REE2_AXI_PERF_MON_S  7
/** HP_PERI0_PMS_AXI_PERF_MON_LOCK : R/W; bitpos: [8]; default: 0;
 *  Set 1 to lock axi_perf_mon peri_apm configuration
 */
#define HP_PERI0_PMS_AXI_PERF_MON_LOCK    (BIT(8))
#define HP_PERI0_PMS_AXI_PERF_MON_LOCK_M  (HP_PERI0_PMS_AXI_PERF_MON_LOCK_V << HP_PERI0_PMS_AXI_PERF_MON_LOCK_S)
#define HP_PERI0_PMS_AXI_PERF_MON_LOCK_V  0x00000001U
#define HP_PERI0_PMS_AXI_PERF_MON_LOCK_S  8

/** HP_PERI0_PMS_HP_CPUPERI0_0_REG register
 *  HP_CPUPERI0 PMS configuration & info register
 */
#define HP_PERI0_PMS_HP_CPUPERI0_0_REG (DR_REG_HP_PERI0_PMS_BASE + 0x200)
/** HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear hp_cpuperi0 peri_pms_record_reg.
 *  0: No clear
 *  1: Clear peri_pms_record_reg
 */
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_CLR    (BIT(0))
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_CLR_M  (HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_CLR_V << HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_CLR_S)
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_CLR_V  0x00000001U
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_CLR_S  0
/** HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_DET : RO; bitpos: [1]; default: 0;
 *  Represents whether the hp_cpuperi0 pms has been triggered.
 *  0: No triggered
 *  1: Has been triggered
 */
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_DET    (BIT(1))
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_DET_M  (HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_DET_V << HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_DET_S)
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_DET_V  0x00000001U
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_DET_S  1
/** HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ID : RO; bitpos: [7:2]; default: 0;
 *  Represents the master id when hp_cpuperi0 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ID    0x0000003FU
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ID_M  (HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ID_V << HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ID_S)
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ID_V  0x0000003FU
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ID_S  2
/** HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_MODE : RO; bitpos: [9:8]; default: 0;
 *  Represents the security mode when hp_cpuperi0 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_MODE    0x00000003U
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_MODE_M  (HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_MODE_V << HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_MODE_S)
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_MODE_V  0x00000003U
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_MODE_S  8

/** HP_PERI0_PMS_HP_CPUPERI0_1_REG register
 *  HP_CPUPERI0 PMS exception addr record register
 */
#define HP_PERI0_PMS_HP_CPUPERI0_1_REG (DR_REG_HP_PERI0_PMS_BASE + 0x204)
/** HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR : RO; bitpos: [27:0]; default: 0;
 *  Represents the access address (bit27~bit0) when hp_cpuperi0 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR    0x0FFFFFFFU
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_M  (HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_V << HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_S)
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_V  0x0FFFFFFFU
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_S  0
/** HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_CONST : HRO; bitpos: [31:28]; default:
 *  2;
 *  Represents the access address (bit31~bit28) when hp_cpuperi0 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_CONST    0x0000000FU
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_CONST_M  (HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_CONST_V << HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_CONST_S)
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_CONST_V  0x0000000FU
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_EXCEPTION_ADDR_CONST_S  28

/** HP_PERI0_PMS_HP_CPUPERI1_0_REG register
 *  HP_CPUPERI1 PMS configuration & info register
 */
#define HP_PERI0_PMS_HP_CPUPERI1_0_REG (DR_REG_HP_PERI0_PMS_BASE + 0x208)
/** HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear hp_cpuperi1 peri_pms_record_reg.
 *  0: No clear
 *  1: Clear peri_pms_record_reg
 */
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_CLR    (BIT(0))
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_CLR_M  (HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_CLR_V << HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_CLR_S)
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_CLR_V  0x00000001U
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_CLR_S  0
/** HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_DET : RO; bitpos: [1]; default: 0;
 *  Represents whether the hp_cpuperi1 pms has been triggered.
 *  0: No triggered
 *  1: Has been triggered
 */
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_DET    (BIT(1))
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_DET_M  (HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_DET_V << HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_DET_S)
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_DET_V  0x00000001U
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_DET_S  1
/** HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ID : RO; bitpos: [7:2]; default: 0;
 *  Represents the master id when hp_cpuperi1 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ID    0x0000003FU
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ID_M  (HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ID_V << HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ID_S)
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ID_V  0x0000003FU
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ID_S  2
/** HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_MODE : RO; bitpos: [9:8]; default: 0;
 *  Represents the security mode when hp_cpuperi1 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_MODE    0x00000003U
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_MODE_M  (HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_MODE_V << HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_MODE_S)
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_MODE_V  0x00000003U
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_MODE_S  8

