espressif/esp-idf/components/soc/esp32s31/register/soc/hp_peri0_pms_reg.h
/** HP_PERI0_PMS_HP_CPUPERI1_1_REG register
 *  HP_CPUPERI1 PMS exception addr record register
 */
#define HP_PERI0_PMS_HP_CPUPERI1_1_REG (DR_REG_HP_PERI0_PMS_BASE + 0x20c)
/** HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR : RO; bitpos: [27:0]; default: 0;
 *  Represents the access address (bit27~bit0) when hp_cpuperi1 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR    0x0FFFFFFFU
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_M  (HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_V << HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_S)
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_V  0x0FFFFFFFU
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_S  0
/** HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_CONST : HRO; bitpos: [31:28]; default:
 *  2;
 *  Represents the access address (bit31~bit28) when hp_cpuperi1 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_CONST    0x0000000FU
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_CONST_M  (HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_CONST_V << HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_CONST_S)
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_CONST_V  0x0000000FU
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_EXCEPTION_ADDR_CONST_S  28

/** HP_PERI0_PMS_HP_PERI0_0_REG register
 *  HP_PERI0 PMS configuration & info register
 */
#define HP_PERI0_PMS_HP_PERI0_0_REG (DR_REG_HP_PERI0_PMS_BASE + 0x210)
/** HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear hp_peri0 peri_pms_record_reg.
 *  0: No clear
 *  1: Clear peri_pms_record_reg
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_CLR    (BIT(0))
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_CLR_M  (HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_CLR_V << HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_CLR_S)
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_CLR_V  0x00000001U
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_CLR_S  0
/** HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_DET : RO; bitpos: [1]; default: 0;
 *  Represents whether the hp_peri0 pms has been triggered.
 *  0: No triggered
 *  1: Has been triggered
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_DET    (BIT(1))
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_DET_M  (HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_DET_V << HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_DET_S)
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_DET_V  0x00000001U
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_DET_S  1
/** HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ID : RO; bitpos: [7:2]; default: 0;
 *  Represents the master id when hp_peri0 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ID    0x0000003FU
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ID_M  (HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ID_V << HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ID_S)
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ID_V  0x0000003FU
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ID_S  2
/** HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_MODE : RO; bitpos: [9:8]; default: 0;
 *  Represents the security mode when hp_peri0 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_MODE    0x00000003U
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_MODE_M  (HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_MODE_V << HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_MODE_S)
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_MODE_V  0x00000003U
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_MODE_S  8

/** HP_PERI0_PMS_HP_PERI0_1_REG register
 *  HP_PERI0 PMS exception addr record register
 */
#define HP_PERI0_PMS_HP_PERI0_1_REG (DR_REG_HP_PERI0_PMS_BASE + 0x214)
/** HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR : RO; bitpos: [27:0]; default: 0;
 *  Represents the access address (bit27~bit0) when hp_peri0 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR    0x0FFFFFFFU
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_M  (HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_V << HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_S)
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_V  0x0FFFFFFFU
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_S  0
/** HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_CONST : HRO; bitpos: [31:28]; default: 2;
 *  Represents the access address (bit31~bit28) when hp_peri0 pms has been triggered.
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_CONST    0x0000000FU
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_CONST_M  (HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_CONST_V << HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_CONST_S)
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_CONST_V  0x0000000FU
#define HP_PERI0_PMS_HP_PERI0_PMS_EXCEPTION_ADDR_CONST_S  28

/** HP_PERI0_PMS_INT_EN_REG register
 *  APM interrupt enable register
 */
#define HP_PERI0_PMS_INT_EN_REG (DR_REG_HP_PERI0_PMS_BASE + 0x300)
/** HP_PERI0_PMS_HP_PERI0_PMS_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures to enable hp_peri0 pms interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_PERI0_PMS_HP_PERI0_PMS_INT_EN    (BIT(0))
#define HP_PERI0_PMS_HP_PERI0_PMS_INT_EN_M  (HP_PERI0_PMS_HP_PERI0_PMS_INT_EN_V << HP_PERI0_PMS_HP_PERI0_PMS_INT_EN_S)
#define HP_PERI0_PMS_HP_PERI0_PMS_INT_EN_V  0x00000001U
#define HP_PERI0_PMS_HP_PERI0_PMS_INT_EN_S  0
/** HP_PERI0_PMS_HP_CPUPERI1_PMS_INT_EN : R/W; bitpos: [1]; default: 0;
 *  Configures to enable hp_cpuperi1 pms interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_INT_EN    (BIT(1))
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_INT_EN_M  (HP_PERI0_PMS_HP_CPUPERI1_PMS_INT_EN_V << HP_PERI0_PMS_HP_CPUPERI1_PMS_INT_EN_S)
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_INT_EN_V  0x00000001U
#define HP_PERI0_PMS_HP_CPUPERI1_PMS_INT_EN_S  1
/** HP_PERI0_PMS_HP_CPUPERI0_PMS_INT_EN : R/W; bitpos: [2]; default: 0;
 *  Configures to enable hp_cpuperi0 pms interrupt.
 *  0: disable
 *  1: enable
 */
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_INT_EN    (BIT(2))
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_INT_EN_M  (HP_PERI0_PMS_HP_CPUPERI0_PMS_INT_EN_V << HP_PERI0_PMS_HP_CPUPERI0_PMS_INT_EN_S)
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_INT_EN_V  0x00000001U
#define HP_PERI0_PMS_HP_CPUPERI0_PMS_INT_EN_S  2

/** HP_PERI0_PMS_BUS_ERR_CONF_REG register
 *  Clock gating register
 */
#define HP_PERI0_PMS_BUS_ERR_CONF_REG (DR_REG_HP_PERI0_PMS_BASE + 0xff0)
/** HP_PERI0_PMS_BUS_ERR_RESP_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether return error response to cpu when access blocked
 *  0: disable error response
 *  1: enable error response
 */
#define HP_PERI0_PMS_BUS_ERR_RESP_EN    (BIT(0))
#define HP_PERI0_PMS_BUS_ERR_RESP_EN_M  (HP_PERI0_PMS_BUS_ERR_RESP_EN_V << HP_PERI0_PMS_BUS_ERR_RESP_EN_S)
#define HP_PERI0_PMS_BUS_ERR_RESP_EN_V  0x00000001U
#define HP_PERI0_PMS_BUS_ERR_RESP_EN_S  0

/** HP_PERI0_PMS_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define HP_PERI0_PMS_CLOCK_GATE_REG (DR_REG_HP_PERI0_PMS_BASE + 0xff8)
/** HP_PERI0_PMS_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: enable automatic clock gating
 *  1: keep the clock always on
 */
#define HP_PERI0_PMS_CLK_EN    (BIT(0))
#define HP_PERI0_PMS_CLK_EN_M  (HP_PERI0_PMS_CLK_EN_V << HP_PERI0_PMS_CLK_EN_S)
#define HP_PERI0_PMS_CLK_EN_V  0x00000001U
#define HP_PERI0_PMS_CLK_EN_S  0

/** HP_PERI0_PMS_DATE_REG register
 *  Version control register
 */
#define HP_PERI0_PMS_DATE_REG (DR_REG_HP_PERI0_PMS_BASE + 0xffc)
/** HP_PERI0_PMS_DATE : R/W; bitpos: [27:0]; default: 38834736;
 *  Version control register
 */
#define HP_PERI0_PMS_DATE    0x0FFFFFFFU
#define HP_PERI0_PMS_DATE_M  (HP_PERI0_PMS_DATE_V << HP_PERI0_PMS_DATE_S)
#define HP_PERI0_PMS_DATE_V  0x0FFFFFFFU
#define HP_PERI0_PMS_DATE_S  0

#ifdef __cplusplus
}
#endif
